{"/faq/":{"data":{"":"","а-какие-свитчи-и-кейкапы-подойдут-для-ваших-клавиатур-если-я-захочу-их-приобрести-в-другом-месте#А какие свитчи и кейкапы подойдут для ваших клавиатур, если я захочу их приобрести в другом месте?":"Наши клавиатуры совместимы с любыми свитчами, которые имееют MX ножки/основу, соответственно у кейкапов также должен быть MX разъём.","в-какие-страны-вы-осуществляете-доставку#В какие страны вы осуществляете доставку?":"Мы отправляем в основном по всему миру. Более подробную информацию о доставке вы можете найти здесь.","как-мне-настроить-клавиатуру-как-переназначить-клавиши#Как мне настроить клавиатуру? Как переназначить клавиши?":"Подробная информация по настройке клавиатур находится в документации.","как-сделать-чтоб-символы-были-на-одном-и-том-же-месте-вне-зависимости-от-раскладки#Как сделать, чтоб символы были на одном и том же месте вне зависимости от раскладки?":"Читайте документацию про режим RuEn.","мне-нужна-низкопрофильная-клавиатура-есть-ли-у-вас-такое#Мне нужна низкопрофильная клавиатура, есть ли у Вас такое?":"Вы можете выбрать все наши клавиатуры со среднепрофильными переключателями и низкопрофильными кейкапами, среднепрофильные переключатели немного выше низкопрофильных, но при этом имеют стандартный MX разъём, что делает их взаимозаменяемыми со стандартными переключателями, при этом разницы по высоте Вы, скорее всего, не заметите.","можете-ли-мне-сделать-индивидуальную-клавиатуру-в-другом-цвете-другой-форме-и-тп#Можете ли мне сделать индивидуальную клавиатуру в другом цвете, другой форме и т.п.":"Нет, подобными заказами мы не занимаемся.","при-выборе-свитчей-есть-варианты-5-pin-или-3-pin-какие-нужно-выбрать#При выборе свитчей есть варианты 5 pin или 3 pin, какие нужно выбрать?":"Обе версии подойдут: у 5 pin свитчей есть две дополнительные пластиковые ножки для лучшего закрепления в плате, для наших клавиатур это не имеет особого значения, т.к. свитчи у нас закрепляются в корпус, а не на плате.","у-вас-есть-на-выбор-различные-переключатели-и-кейкапы-какие-мне-лучше-всего-выбрать#У Вас есть на выбор различные переключатели и кейкапы, какие мне лучше всего выбрать?":"Самый распространённый вариант это Brown переключатели (тактильные) и XDA кейкапы.","я-новичок-с-какой-клавиатуры-мне-лучше-всего-начать#Я новичок, с какой клавиатуры мне лучше всего начать?":"Советуем начать с 60% раскладки: K:03, HPD."},"title":"Ответы на часто задаваемые вопросы"},"/new/":{"data":{"":"flowchart TD; First[Это Ваш первый сплит?] -- Да --\u003e Q3 First[Это Ваш первый сплит?] -- Нет --\u003e Second Second(Хотите 40% или 60% раскладку?) -- 40% --\u003e Q4(Хотите изогнутый вариант?) Second(Хотите 40% или 60% раскладку?) -- 60% --\u003e Q3(Хотите изогнутый вариант?) Q3 -- Нет --\u003e K03[K:03] Q3 -- Да --\u003e HPD[High Plains Drifter] Q4 -- Нет --\u003e I44[Imperial44] Q4 -- Да --\u003e V[Velvet] I44[Imperial44] --\u003e Q5(Ещё меньше клавиш?) Q5(Ещё меньше клавиш?) -- Да --\u003e OP36(Omega Point 36)"},"title":"С чего начать?"},"/qmk/":{"data":{"":"QMK + Vial — это связка прошивки и удобного конфигуратора, которая делает клавиатуру по‑настоящему «вашей».\nНа базе QMK можно гибко настроить слои, модификаторы, макросы, удержания/тапы и логику клавиш под работу, игры или конкретные приложения.\nА Vial добавляет главное: быструю настройку через графический интерфейс без постоянной пересборки прошивки — меняйте раскладку, переназначайте клавиши и записывайте макросы в пару кликов и сразу проверяйте результат."},"title":"Документация по QMK прошивке"},"/qmk/ruen/":{"data":{"":"Этот режим предназначен для того, чтобы\nрасположить знаки пунктуации в одних и тех же местах для русского и английского языка, вводить символы из английской раскладки при печати в русской, переключать раскладку на английскую или русскую отдельными клавишами. Это работает благодаря тому, что клавиатура помнит текущую раскладку, и при необходимости ввести символ, отсутствующий в русской раскладке, автоматически переключает раскладку, а после ввода символа возвращает раскладку обратно.\nОсновное достоинство такого подхода заключается в том, что нет необходимости устанавливать в систему дополнительное ПО или нестандартные раскладки.\nОсновной недостаток — необходимость поддерживать одинаковое состояние раскладки в клавиатуре и в системе. Подробнее о том, как это обеспечить, будет рассказано ниже.\nКлавиши режима RuEn можно найти в программе Vial во вкладке User. Все клавиши этого режима начинаются со слова RuEn. Чтобы воспользоваться ими, нужно добавить их к себе в раскладку (в любой удобный слой).","linux#Linux":"Нужно убедиться, что\nсочетание клавиш Win+Space действительно переключает раскладку (для Ubuntu такое включено по умолчанию, для других дистрибутивов может потребоваться настройка), не используется индивидуальная раскладка для каждого окна.","mac#Mac":"Нужно выполнить следующие действия:\nустановить для русского раскладку Russian PC, либо оставить родную раскладку и нажать кнопку RuEn Mac Tg, выбрать способ переключения Ctrl+Space, включить на клавиатуре режим Mac (по умолчанию на месте клавиши B в желтом слое, она же кнопка Toggle Ctl Gui из вкладки Quantum программы Vial).","ruen-dflt#RuEn Dflt":"При нажатии этой клавиши клавиатура использует сочетание Win+Space для смены раскладки если не выбран режим Mac. В режиме Mac (включается сочетанием клавиш Toggle Ctl Gui из вкладки Quantum) клавиатура для переключения раскладки будет слать сочетание Ctl+Space.\nЭтот режим включается по умолчанию. Нажатие на клавишу RuEn Dflt необходимо в том случае, если ранее был включен другой режим переключения раскладки.","ruen-en#RuEn En":"Для режимов RuEn Dflt, RuEn M0 действует следующим образом:\nесли в клавиатуре русская раскладка, то отправляет сочетание смены раскладки и меняет внутреннее состояние на английскую раскладку, если в клавиатуре английская раскладка, то ничего не делает. Для режима RuEn M1M2 логика работы несколько меняется:\nесли в клавиатуре русская раскладка, то отправляет сочетание смены раскладки на английскую (макрос M1) и меняет внутренне состояние на английскую раскладку, если в клавиатуре английская раскладка, то отправляет сочетание смены раскладки на английскую (макрос M1), внутренне состояние остается на английской раскладке.","ruen-m0#RuEn M0":"Позволяет изменить способ переключения раскладки по умолчанию. Для настройки этого режима нужно выполнить следующие действия:\nЗадать в макросе M0 необходимую последовательность для переключения раскладки. Для тестирования можно временно поместить макрос M0 в текущую раскладку, чтобы проверить его работу. Нажать на клавишу RuEn M0. После этого клавиатура вместо дефолтной комбинации для переключения раскладки будет отправлять макрос M0. Такой способ переключения может быть полезен в разных случаях:\nпереключение раскладки в системе не совпадает с дефолтным; имеются проблемы с дефолтным переключением: например, Windows и Ubuntu при переключении кратковременно показывает специальное окошко с выбором раскладки, которое перетягивает на несколько миллисекунд фокус на себя; опытным путем в дефолтном способе были подобраны задержки, достаточные для того, чтобы фокус этого окошка пропал; к сожалению, нет гарантий, что на вашей системе хватит этих задержек; либо наоборот: раздражает всплывающее окошко с раскладкой в Windows и хочется сделать так, чтобы раскладка переключалась по комбинации Shift+Alt.","ruen-m1m2#RuEn M1M2":"Позволяет задать отдельные макросы для переключения раскладки на английскую и русскую. Для настройки этого режима нужно выполнить следующие действия:\nНастроить в системе комбинацию клавиш включения английской раскладки и комбинацию клавиш включения русской раскладки. Задать в макросе M1 комбинацию переключения на английскую раскладку. Задать в макросе M2 комбинацию переключения на русскую раскладку. Желательно также временно поместить эти макросы на текущую раскладку и отладить их работу. Нажать на клавишу RuEn M1M2. После этого клавиатура вместо дефолтной комбинации для переключения раскладки будет отправлять макрос M1 для включения английской раскладки и макрос M2 для включения русской раскладки. Этот режим полезен тем, что клавиатура отправляет комбинацию смены языка независимо от того, в каком состоянии находится внутренняя раскладка. Тем самым получается, что нет необходимости синхронизировать внутреннее состояние и раскладку в системе: достаточно один раз нажать RuEn Ru или RuEn En и внутреннее состояние станет совпадать с раскладкой в системе (клавиша RuEn Sync в этом случае не нужна). Клавиша RuEn Toggle также будет работать, но присмотритесь все же к паре клавиш RuEn Ru и RuEn En (поверьте, это очень удобно, когда привыкнешь).\nЭтот режим также может быть особенно полезен, если приходится набирать текст на удаленных машинах, каждая из которых может иметь свою состояние раскладки.","ruen-modtg#RuEn Mod/Tg":"Переключает раскладку при коротком нажатии (работает как RuEn Toggle) или же временно переключает раскладку при удержании и возвращает раскладку обратно при отпускании. Таким образом, удерживая эту клавишу, можно вводить символы и последовательности из другой раскладки.","ruen-ru#RuEn Ru":"Для режимов RuEn Dflt, RuEn M0 действует следующим образом:\nесли в клавиатуре английская раскладка, то отправляет сочетание смены раскладки и меняет внутреннее состояние на русскую раскладку, если в клавиатуре русская раскладка, то ничего не делает. Для режима RuEn M1M2 логика работы несколько меняется:\nесли в клавиатуре английская раскладка, то отправляет сочетание смены раскладки на русскую (макрос M2) и меняет внутренне состояние на русскую раскладку, если в клавиатуре русская раскладка, то отправляет сочетание смены раскладки на русскую (макрос M2), внутренне состояние остается на русской раскладке.","ruen-store--ruen-revert#RuEn Store / RuEn Revert":"Иногда требуется ввести макрос в определенной раскладке, а затем вернуться в исходную раскладку. Для этого нужно в начале макроса вставить RuEn Store, а в конце вставить RuEn Revert.","ruen-sync#RuEn Sync":"Переключает состояние раскладки в клавиатуре, не отправляя никаких последовательностей в систему. Однократное нажатие переводит состояние из английского в русский или из русского в английский.","ruen-toggle#RuEn Toggle":"Переключает внутреннее состояние и отправляет сочетание смены раскладки в систему.","windows#Windows":"Особой предварительной настройки не требуется. Нужно убедиться, что\nсочетание клавиш Win+Space действительно переключает раскладку (для Windows 8 и новее такое должно быть по умолчанию), не используется индивидуальная раскладка для каждого окна.","буквы-бюжэхъё#Буквы БЮЖЭХЪЁ":"Буквы БЮЖЭХЪЁ в английской раскладке соответствуют знакам препинания. Чтобы избавиться от практики нажимания этих клавиш в английской раскладке и скорее привыкнуть к универсальным RuEn-символам можно добавить себе в раскладку следующие символы:\nRuEn Б RuEn Ю RuEn Ж RuEn Э RuEn Х RuEn Ъ RuEn Ё При нажатии на этот символ в английской раскладке ничего не происходит.","ввод-unicode-символов#Ввод Unicode-символов":"Ожидайте в следующих прошивках.","дополнительные-возможности#Дополнительные возможности":"","использование-программы-qmk-hid-host#Использование программы qmk-hid-host":"Эта программа запускается на компьютере и отправляет клавиатуре различную информацию:\nтекущее время, текущий уровень громкости, информацию об исполнителе и названии играющего медиа, текущую раскладку окна. Программа доступна для ОС Windows и Linux, скачать ее можно по ссылке. Это форк, в котором изменены настройки по умолчанию с той целью, чтобы для клавиатур Ergohaven не приходилось редактировать файл настроек. Большая благодарность автору оригинальной программы zzeneg’у (он есть в нашем чате).\nФорк поддерживает одно активное устройство\nДля режима RuEn здесь ключевое то, что при использовании этой программы:\nотменяется необходимость следить за синхронизацией раскладки в клавиатуре и в системе появляется возможность использовать для каждого окна индивидуальную раскладку.","клавиши-переключения-раскладки#Клавиши переключения раскладки":"","настройки-режима-переключения-раскладки#Настройки режима переключения раскладки":"","описание-клавиш#Описание клавиш":"","предварительные-настройки#Предварительные настройки":"Ниже описаны несложные процедуры для предварительной настройки операционной системы и клавиатуры для работы режима RuEn. Это настройки по умолчанию, и если вы первый раз настраиваете RuEn, рекомендуется пройти по этому пути.\nТем не менее, в некоторых случаях настройки по умолчанию могут вам не подойти:\nесли у вас в системе используется нестандартное сочетание клавиш для смены раскладки, смотрите секцию RuEn M0 и RuEn M1M2; если вы много работаете с удаленными машинами (например, по RDP) и вам необходимо часто синхронизировать раскладку удаленной машины с раскладкой клавиатуры, смотрите секцию RuEn M1M2; если вам необходимо иметь для каждого окна индивидуальную раскладку, или если у вас часто по какой-либо причине происходит рассинхронизация раскладки клавиатуры и системы, или же вам очень неудобно использовать клавиши RuEn Toggle, RuEn En, RuEn Ru для переключения раскладки, смотрите секцию Использование программы qmk-hid-host. Рекомендуется все же дочитать эту и следующую секцию, чтобы получить общее представление о режиме RuEn, а затем приступать к более сложной настройке.","режим-caps-word#Режим CAPS WORD":"Режим CAPS WORD (включается при нажатии одновременно левого и правого шифтов) позволяет ввести одно слово в верхнем регистре и автоматически выйти из этого режима по нажатии на символ, разделяющий слова. В режиме RuEn поддержана режим CAPS WORD: символы, которые в английской раскладке являются разделителями слов (такие как ЖЭХЪЁБЮ) не прерывают режим CAPS WORD, если набираются в русской раскладке.","режим-ruen-word#Режим RuEn word":"Этот режим чем-то похож на режим CAPS WORD. Он полезен при наборе в русской раскладке, т.к. предоставляет возможность ввести одно слово в английской раскладке а после ввода автоматически переключиться на русскую раскладку.\nКонец слова в режиме RuEn word определяется по нажатию на Space, Enter, Escape, Minus.\nКроме того, если перед нажатием на RuEn word была зажата клавиша Shift, вместе в RuEn word также включается режим CAPS WORD.\nЕсли вам часто приходится набирать технические или математические тексты на русском языке изобилующие английскими вставками, этот режим может стать хорошим подспорьем.\nПримеры подобного текста\nIP-адрес, стек TCP/IP, модель OSI имя переменной `helloWorld` LaTeX-уравнения вида $x^2+y^2=0$","символ-из-русской-раскладки#Символ из русской раскладки":"Единственный символ, который имеется в русской раскладке и отсутствует в английской:\nRuEn № Ввод этого символа работает аналогично предыдущему пункту, только временно переключает на русскую раскладку, если текущая раскладка английская.","символы-из-английской-раскладки#Символы из английской раскладки":"При наборе этих символов из русской раскладки производится автоматическое переключение на английскую раскладку, а после ввода символа производится переключение обратно на русскую. При наборе этих символов из английской раскладки, переключения раскладки не производится.\nRuEn [ RuEn ] RuEn { RuEn } RuEn \u003c RuEn \u003e RuEn ` RuEn ~ RuEn @ RuEn # RuEn $ RuEn ^ RuEn \u0026 RuEn |","символы-имеющиеся-в-русской-и-английской-раскладке#Символы, имеющиеся в русской и английской раскладке":"При наборе этих символов не происходит переключение раскладки, т.к. они имеются и в русской и в английской раскладке:\nRuEn . RuEn , RuEn ; RuEn : RuEn \" RuEn ? RuEn /","синхронизация-и-переключение-раскладки#Синхронизация и переключение раскладки":"Чтобы клавиатура правильно переключала раскладку, нужно чтобы раскладка клавиатуры совпадала с раскладкой в системе. Для этого нужно соблюдать два правила:\nСначала нужно сделать так, чтобы раскладка в системе и клавиатуре совпадали; иными словами нужно синхронизировать раскладку в системе и в клавиатуре. А затем, чтобы синхронизация не сбивалась, для переключения раскладки использовать только специальные клавиши: RuEn Toggle, RuEn Ru, RuEn En. Проверить раскладку в клавиатуре можно следующими способами:\nтекущую раскладку в клавиатуре можно увидеть на экране (Planeta V2, K:03 PRO, а также K:02, K:03, Imperial44 при выбранном режиме экрана Modern или Minimalistic); если же экрана нет, то можно определить раскладку опытным путем: выбрать в системе английскую раскладку и нажать на клавишу RuEn ., если отправилась ., то в клавиатуре английская раскладка, а если отправилась ю, то в клавиатуре русская раскладка; можно также использовать такое соображение: при включении в клавиатуре устанавливается английская раскладка. В случае, если раскладка в системе и в клавиатуре не совпадают, необходимо выполнить синхронизацию. Сделать это можно различными способами:\nодин раз нажать на клавишу RuEn Sync; в этом случае клавиатура изменит внутреннее состояние, ничего не отправляя в систему; изменить раскладку в системе, используя стандартную комбинацию для смены раскладки; изменить раскладку в системе с помощью кликов мышки по значку раскладки. После того, как вы убедились, что раскладка в клавиатуре такая же, как в системе, необходимо проверить, что клавиша RuEn Toggle одновременно переключает раскладку и в системе, и в клавиатуре.\nТакже в режиме RuEn имеется пара клавиш для переключения раскладки сразу на нужный язык: RuEn En и RuEn Ru. Клавиша RuEn En переключает на английскую раскладку в том случае, если в данный момент используется русская раскладка и ничего не меняет, если уже и так установлена английская раскладка. Клавиша RuEn Ru делает то же самое с точностью до наоборот: включает русскую раскладку, только если сейчас установлена английская.\nРекомендуется переучиться на использование клавиш RuEn En / RuEn Ru для переключения раскладки. В этом случае перед тем, как начать писать, можно сразу выставить нужную раскладку. Со временем это будет делаться автоматически, и это быстрее, чем смотреть индикатор раскладки в системе или же писать что-то, затем удалять, переключать раскладку, и набирать заново.\nНа этом основную настройку можно считать законченной. Далее следует справочная информация о клавишах режима RuEn и описание продвинутых режимов."},"title":"Режим RuEn"},"/qmk/vial/":{"data":{"":"Vial — это кроссплатформенный графический интерфейс с открытым исходным кодом и форк QMK для настройки клавиатуры в режиме реального времени.\nПрограмма позволяет настроить клавиатуру с помощью простого и интуитивно понятного интерфейса без каких-либо знаний о программировании.","combos#Combos":"Эта функция представляет собой решение типа аккорда для добавления пользовательских действий. Назначьте любые две клавиши, как одну. При одновременном нажатии двух клавиш (за определенное кол-во времени) срабатывает третья.","key-overrides#Key overrides":"Данная функция позволяет вам переназначить клавиши-модификаторы при их нажатии совместно с любой другой клавишей","keymap#Keymap":"Как следует из названия, здесь вы можете просмотреть и настроить свою раскладку. Просто кликните на любую клавишу, которую вы хотите изменить, в верхнем меню, а затем выберите клавишу для замены в нижнем меню. Ваша новая клавиша будет немедленно готова к использованию.","layer#Layer":"Слои позволяют изменять функциональность всей клавиатуры в зависимости от того, на каком слое она находится в данный момент. Лучше всего представить слои, как будто они расположенны друг над другом. Клавиши можно настроить для переключения между слоями по мере необходимости, аналогично клавише Shift в числовом ряду. Вы можете просмотреть каждый доступный слой, щелкнув соответствующий номер в верхней части интерфейса. Layer 0 — это ваш базовый/основной слой.\nПереключение между слоями может осуществляться несколькими способами. В нижнем меню выберите вкладку слоя, чтобы просмотреть все различные параметры.\nMO(*) - моментально активирует слой. Как только вы отпустите клавишу, слой деактивируется DF(*) - изменяет, какой слой является слоем по умолчанию. Это остается до тех пор, пока вы не отключите девайс TG(*) - переключает слой, активируя его, если он неактивен, и наоборот TT(*) - Если вы удерживаете клавишу нажатой, слой активируется, а затем деактивируется, когда вы отпускаете (как МО). Если вы несколько раз коснетесь его, слой будет включен или выключен (например, TG). Для этого нужно 5 нажатий OSL(*) - моментально активирует слой, пока не будет нажата следующая клавиша LT layer (kc) - мгновенно активирует слой, когда он удерживается, отправляет код клавиши при нажатии. Код клавиши можно определить, как и все другие кнопки, просто выберите меньшее поле внутри","macros#Macros":"Макросы позволяют отправлять несколько нажатий клавиш при нажатии только одной клавиши. Они могут делать все, что вы хотите: печатать целые предложения, повторять однотипные действия в играх или даже помогать вам программировать.","matrix-tester#Matrix Tester":"Здесь вы можете проверить нажатие клавиш на клавиатуре.","qmk-settings#QMK Settings":"Данная вкладка нужна для тонкой настройки работы QMK.\nMagic - поменять местами разные клавиши-модификаторы для удобства Grave Escape - эта функция позволяет вам использовать клавишу Grave (` и ~) с помощью Escape Tap-Hold - точная настройка функции tap hold Auto Shift - нажмите клавишу c буквой и она напечатается. Нажмите клавишу и удерживайте ее немного дольше, и вы получите её заглавный вариант. Combo - точная настройка combo функции One Shot Keys - точная настройка one shot клавиш Mouse Keys - точная настройка клавиш мыши","tap-dance#Tap Dance":"Данная функция, позволяет менять назначение клавиш в зависимости от того, сколько раз вы нажали клавишу и удерживаете ли вы ее. Например, клавиши X, C, V могут выполнять функции Вырезать, Копировать и Вставить, пока вы удерживаете клавишу в течение короткого времени — никаких модификаторов не требуется. Или нажмите клавишу точки с запятой один раз, отправьте точку с запятой. Нажмите дважды, быстро — поставьте двоеточие.","использование-combo#Использование Combo":"После того, как Combo настроено и сохранено, его можно использовать. Нет необходимости назначать его на конкретную клавишу.\nДополнительную информацию о функции Combo можно найти в официальной QMK документации","использование-key-overrides#Использование key overrides":"После настройки функции key override её можно сразу использовать. Нет необходимости назначать на конкретную клавишу.\nДополнительную информацию о функции Key Overrides можно найти в официальной QMK документации","использование-macros#Использование Macros":"После настройки макроса его можно использовать. Просто нажмите на клавишу, которую вы хотите использовать для макроса в раскладке, затем выберите ее в нижнем меню на вкладке Macro\nДополнительную информацию о функции Macros можно найти в официальной QMK документации","использование-tap-dance#Использование Tap Dance":"После того, как функция tap dance настроена и сохранена, её можно использовать. Просто нажмите на клавишу, которую вы хотите использовать для tap dance, в раскладке клавиш, а затем выберите ее в нижнем меню на вкладке Tap Dance\nДополнительную информацию о функции Tap Dance можно найти в официальной QMK документации","конфигурация-macros#Конфигурация Macros":"Откройте вкладку Macros. Все макросы, которые можно настроить, будут отображаться в виде отдельных вкладок. Выберите макрос, который вы хотите настроить.\nСледующим шагом будет добавление действий:\nAdd action — вручную добавляет действие в список. Настройте его так, чтобы он делал именно то, что вы хотите. выберите один из вариантов — удерживайте, нажмите, отпустите и задержите. Tap Enter — многие макросы заканчиваются клавишей Enter, поэтому эта кнопка упрощает их добавление. Record macro — позволяет записывать макрос прямо с клавиатуры. Используйте эти клавиши для добавления действий в список. Они будут выполняться по порядку при активации макроса. Действия можно изменить с помощью стрелок слева. Когда вы будете удовлетворены конфигурацией всех макросов, нажмите Save, чтобы сохранить все изменения. Если вы хотите вернуться к тому, что уже есть на устройстве, нажмите Revert.","настройка-combo#Настройка Combo":"Щелкните вкладку Combo вверху и один из доступных номеров под ней, чтобы отобразить настройки для этой конкретной комбинации. Можно настроить до 4-х комбинаций клавиш для активации одного действия. Каждая клавиша должна быть нажата в течение срока комбо. В приведенном ниже примере нажатие клавиши +/= и клавиши Backspace вместо этого произойдёт нажатие клавиши Delete","настройка-key-overrides#Настройка Key Overrides":"В приведенном ниже примере при нажатии комбинации клавиш Left Ctrl + Backspace (две клавиши нужно нажимать без какого-либо определенного временного окна) будет заменено на Delete","настройка-tap-dance#Настройка Tap Dance":"Нажмите на вкладку Tap Dance вверху и на один из доступных номеров под ней. Каждая функция Tap Dance может быть настроена на выполнение различных действий в зависимости от того, как нажимается кнопка. В приведенном ниже случае, когда кнопка On tap (При нажатии), левый графический интерфейс нажимается, но когда кнопка On hold (При удержании), кнопка активирует слой 1. Два других варианта On double tap (При двойном нажатии) и On tap + hold ( На тап + удержание) тоже можно настроить.\nTapping term представляет собой время, в течение которого прошивка различает действия. Если кнопка удерживается дольше, чем срок нажатия, это считается удержанием. Если кнопка удерживается меньше, чем срок нажатия, это считается нажатием. Когда вы будете удовлетворены конфигурацией, нажмите Save, чтобы сохранить все изменения. Если вы хотите вернуться к тому, что уже есть на устройстве, нажмите Revert.","первое-использование#Первое использование":"Скачайте и установите последнюю версию программы Подключите клавиатуру и она будет автоматически обнаружена Разблокируйте клавиатуру, кликнув на меню Security, а затем Unlock, и следуйте инструкции, которая будет отображена на экране Измените любую клавишу, которую вы хотите, и она будет мгновенно переназначена, настройте различные параметры по своему вкусу Сохраните раскладку, нажав File \u003e Save current layout (опционально) Давайте теперь проверим, что делают основные вкладки","примеры#Примеры":"Открыть Панель Задач на Windows зажав Ctrl+Shift и потом нажать Esc:\nЗапуск программы в Windows, открыв меню Пуск, введя имя программы и нажав Enter:\nВвод адреса:","примеры-использования-слоёв#Примеры использования слоёв:":"Отдельный слой под макросы, которые помогают быстро работать с входящей почтой Еще один слой позволяет открывать нужные нам папки или приложения за доли секунд Следующий слой настроен для оперативной работы в браузере На отдельный слой можно разместить “куски” кода Также, можно настроить специальный слой для игр Символ треугольника обозначает пропуск. Это значит, что действие такое же, как и слой под ним. Это удобно, так как клавиши из разных слоев могут быть нажаты одновременно.\nТеперь давайте посмотрим на вкладки нижнего меню и проверим, что они делают\nBasic и ISO/JIS - это стандартные раскладки клавиатур ANSI, ISO, JIS Layers - см. информацию о слоях выше Quantum - конкретные коды клавиш из прошивки QMK, наведите курсор на любой интересующий код клавиши и появится описание Backlight - управление RGB подсветкой (в случае если ваша клавиатура поставляется с ней) непосредственно с клавиатуры App, Media and Mouse - дополнительные клавиши для управления приложениями и воспроизведением мультимедиа, также здесь вы можете настроить клавиатуру для выполнения действий мыши Tap Dance - настройте различные действия в зависимости от того, как используется клавиша. Например, одна и та же клавиша может быть настроена на активацию макроса при нажатии или активацию чего-либо еще при удерживании (см. информацию ниже). User - здесь вы можете найти пользовательские клавиши, которые мы запрограммировали для вашего использования, как и раньше, просто наведите курсор, чтобы узнать, что делает каждая функция Macro - макросы можно использовать для выполнения заранее запрограммированной последовательности действий (см информацию ниже)"},"title":"Всё о программе Vial"},"/roadmap/":{"data":{"":"","2025#2025":"HPD v2 Imperial44 v3 HPD v2 Open Source K:03 PRO v2 Velvet v3 Wireless edition Project “op36” Handrests for UTS New packaging New keycaps Expo Project “Gamer” Imperial44 Spaceship edition Velvet “UI” edition K:03 Wireless edition Imperial44 Wireless edition Deskmats Noise insulation New modules for HPD Dongle for wireless keyboards Spaceship edition for K:03 wireless OP36 Spaceship edition Дисклеймер: вся информация на данной странице не утверждена окончательно и предоставлена для ознакомления. Изменения и дополнения будут происходить на постоянной основе.","2026#2026":"Trackball Royale Project “Modular minds” Expo New switches Planeta v3 Project “freemove” Project “Sprawl”"},"title":"Ergohaven's timeline"},"/wired/":{"data":{"":"Проводные девайсы работают на прошивке QMK и настраиваются через программу Vial\nHigh Plains Drifter Imperial44 K:03 Macropad Space Mission 30 Velvet"},"title":"Проводные девайсы"},"/wired/hpd/":{"data":{"":"","модули-для-hpd-v2#Модули (для HPD v2)":"HPD v2 позволяет расширить свой функционал путем установки модулей Левая половинка:\nЭнкодер с индикаторной подсветкой (подсветка активного слоя при его активации, программируемый энкодер для регулировки громкости, навигации и других полезных функций) Правая половинка:\nЭнкодер с индикаторной подсветкой (такой же функционал, как у модуля на левой половинке) Трекбол 38мм (для управления курсором) Тачпад 43х40мм (для управления курсором, поддержка функций: тап - левая кнопка мыши, тап двумя пальцами - правая кнопка, тап + зажатие - выделение текста, объектов, зажатие двумя пальцами - скролл) Джойстик (эмуляция мыши или можно назначить до 5-ти клавиш на каждый слой)","настройка-dpi-и-auto-mouse-в-vial-для-модулeй-trackball-и-touchpad#Настройка DPI и Auto mouse в Vial (для модулeй Trackball и Touchpad)":"У модулей трекбола и тачпада можно настраивать чувствительность перемещения курсора (DPI) и автоматическую активацию слоя мыши (Auto mouse)\nИзменение DPI в Vial Откройте Vial В верхнем меню перейдите во вкладку Layouts Выберите нужное значение DPI в раскрывающемся списке напротив пункта DPI В данной вкладке так же можно настроить:\nAcceleration - включение/выключение ускорения перемещения курсора Invert scroll - включение/выключение инверсии для функции скролла Sniper sens - изменение чувствительности перемещения курсора для Sniper Mode Scroll sens - изменение чувствительности перемещения курсора для Scroll Mode Text sens - изменение чувствительности перемещения курсора для Text Mode Настройка Auto mouse в Vial Скачайте и откройте форк Vial от Ergohaven В верхнем меню перейдите во вкладку QMK Settings Ниже выберите вкладку Auto mouse Включите автоматическую активацию слоя мыши установив галочку в пункте Enable auto mouse layer feature Нажмите Save в нижнем правом углу для сохранения изменений В данной вкладке так же можно настроить:\nIndex of layer to use as default target layer - выбор слоя, который активируется при включенной функции Auto mouse, по умолчанию это 4 слой в стандартной прошивке от Ergohaven Time layer remains active after activation - изменение времени в миллисекундах, при котором слой мыши останется включенным после его активации, чем больше это значение, тем дольше слой мыши остается включенным Time delay from last activation to next update - изменение времени опроса в миллисекундах на включение слоя мыши","настройка-клавиатуры#Настройка клавиатуры":"Пожалуйста перейдите в статью о программе Vial","обновление-прошивки#Обновление прошивки":"","подготовка#Подготовка":"Скачайте последнюю версию прошивки здесь Сохраните Вашу раскладку в программе Vial, нажав на меню “File”, дальше “Save current layout”","подключение#Подключение":"Клавиатура High Plains Drifter работает с устройствами под управлением Windows, macOS, Linux, Android, iOS Подключение клавиатуры осущевствляется посредством Plug and Play (PnP), дополнительная установка драйверов не требуется Перед подключением к компьютеру, убедитесь, что USB-C кабель, соединяющий обе половинки между собой, плотно подключен в разъёмы на двух половинках При подключении к компьютеру, убедитесь, что кабель USB-C плотно вставлен в разъем","прошивки-для-hpd-v2-и-их-описание#Прошивки для HPD v2 и их описание":"no modules - прошивка для конфигурации без модулей encoder/trackball - прошивка для модуля энкодера с индикаторной подсветкой на левую половинку, либо прошивка для модуля трекбола на правую половинку, либо совместное использование этих модулей encoder/touch - прошивка для модуля энкодера с индикаторной подсветкой на левую половинку, либо прошивка для модуля тачпада на правую половинку, либо совместное использование этих модулей encoder/joystick - прошивка для модуля энкодера с индикаторной подсветкой на левую половинку, либо прошивка для модуля джойстика на правую половинку, либо совместное использование этих модулей encoder/encoder - прошивка для модуля энкодера с индикаторной подсветкой на левую половинку, либо прошивка для модуля энкодера с индикаторной подсветкой на правую половинку, либо совместное использование этих модулей","установка#Установка":"Левая половинка:\nЗажмите верхнюю левую клавишу и подключите USB кабель питания в левую половинку Дождитесь когда контроллер перейдёт в режим загрузчика и откроется папка-хранилище Скопируйте или перетащите Uf2 файл, после чего контроллер должен моментально перезагрузиться и начать работать в обычном режиме Импортируйте в программу Vial раскладку, нажав на меню “File”, дальше “Load saved layout” Правая половинка:\nЗажмите верхнюю правую клавишу на правой половинке (HPD v2) или верхнюю левую клавишу (HPD v1) и подключите USB кабель питания в правую половинку Повторите остальные пункты, как для левой половинки","установка-и-настройка-модулей#Установка и настройка модулей":"Перед извлечением/установкой модуля рекомендуется отключить мастер половинку от устройства (ПК, ноутбука, планшета и т.п.) Извлеките заменяемый модуль или боковую заглушку разьема (при наличии). Модуль вытягивается в противоположную сторону, относительно его ориентации (для левой половинки - в правую сторону, для правой половинки - в левую). Не следует выгибать модуль вверх/вниз относительно плоскости клавиатуры, так как это может повредить разъемы на самом модуле и клавиатуре Установка модуля выполняется аналогично извлечению, расположите необходимую половинку и модуль для нее в одной плоскости (например, на ровную поверхность). Состыкуйте разъемы на модуле и клавиатуре между собой, избегайте перекосов модуля относительно клавиатуры и больших усилий при состыковке. До конца вставьте модуль в клавиатуру, при этом допускается небольшой зазор между некоторыми изгибами корпусами клавиатуры и модуля Прошейте обе половинки клавиатуры на соответствующие версии прошивок, аналогично инструкции для обновления прошивки Модули для HPD v2 требуют обязательной перепрошивки после замены одного модуля на другой (например, если был установлен тачпад, и его заменить на трекбол, то без перепрошивки трекбол работать не будет)."},"title":"High Plains Drifter v2"},"/wired/imperial44/":{"data":{"":"","настройка-клавиатуры#Настройка клавиатуры":"Пожалуйста перейдите в статью о программе Vial","обновление-прошивки#Обновление прошивки":"","подготовка#Подготовка":"Скачайте последнюю версию прошивки здесь Сохраните Вашу раскладку в программе Vial, нажав на меню “File”, дальше “Save current layout”","подключение#Подключение":"Перед подключением к компьютеру, убедитесь, что USB-C кабель, соединяющий обе половинки между собой, плотно подключен в разъёмы на двух половинках При подключении к компьютеру, убедитесь, что кабель USB-C плотно вставлен в разъем","установка#Установка":"Левая половинка:\nЗажмите верхнюю левую клавишу и подключите USB кабель питания в левую половинку Дождитесь когда контроллер перейдёт в режим загрузчика и откроется папка-хранилище Скопируйте или перетащите Uf2 файл, после чего контроллер должен моментально перезагрузиться и начать работать в обычном режиме Импортируйте в программу Vial раскладку, нажав на меню “File”, дальше “Load saved layout” Правая половинка:\nЗажмите верхнюю правую клавишу на правой половинке и подключите USB кабель питания в правую половинку Повторите остальные пункты, как для левой половинки"},"title":"Imperial44"},"/wired/k03/":{"data":{"":"","настройка-клавиатуры#Настройка клавиатуры":"Пожалуйста перейдите в статью о программе Vial","обновление-прошивки#Обновление прошивки":"","подготовка#Подготовка:":"Скачайте последнюю версию прошивки здесь Сохраните Вашу раскладку в программе Vial, нажав на меню “File”, дальше “Save current layout”","подключение#Подключение":"Перед подключением к компьютеру, убедитесь, что USB-C кабель, соединяющий обе половинки между собой, плотно подключен в разъёмы на двух половинках При подключении к компьютеру, убедитесь, что кабель USB-C плотно вставлен в разъем","установка#Установка":"Левая половинка:\nЗажмите верхнюю левую клавишу и подключите USB кабель питания в левую половинку Дождитесь когда контроллер перейдёт в режим загрузчика и откроется папка-хранилище Скопируйте или перетащите Uf2 файл, после чего контроллер должен моментально перезагрузиться и начать работать в обычном режиме Импортируйте в программу Vial раскладку, нажав на меню “File”, дальше “Load saved layout” Правая половинка:\nЗажмите верхнюю правую клавишу на правой половинке и подключите USB кабель питания в правую половинку Повторите остальные пункты, как для левой половинки"},"title":"K:03"},"/wired/macropad/":{"data":{"":"Macropad - проводной программируемый механический макропад с энкодером и хотсвап-системой для быстрой замены MX-совместимых свитчей","настройка-макропада#Настройка макропада":"Пожалуйста перейдите в статью о программе Vial\nMacropad v3 - настройка RGB подсветки в Vial В Vial во вкладке Lighting можно кастомизировать подсветку клавиш изменяя вид, цвет, яркость и скорость анимации\nНа Macropad v1 и v2 RGB подсветка отсутствует! RGB Effect - позволяет выбрать различные анимации либо статичный цвет RGB Color - настройка цвета подсветки RGB Brighttless - изменение яркости подсветки RGB Speed - изменение скорости анимации подсветки После настройки всех параметров RGB подсветки нажмите Save в нижнем правом углу Vial, чтобы сохранить все изменения","обновление-прошивки#Обновление прошивки":"Версия прошивки должна соответствовать версии макропада, иначе получите некорректную работу макропада","подготовка#Подготовка":"Скачайте последнюю версию прошивки для вашей версии макропада Сохраните Вашу раскладку в программе Vial, нажав на меню “File” \u003e “Save current layout”","подключение#Подключение":"Макропад работает с устройствами под управлением Windows, macOS, Linux, Android, iOS Подключение макропада осущевствляется посредством Plug and Play (PnP), дополнительная установка драйверов не требуется При подключении к устройству, убедитесь, что кабель USB-C плотно вставлен в разъем макропада","установка#Установка":"Для перепрошивки/обновления встроенного ПО (firmware) макропад необходимо перевести в режим загрузчика (bootloader), сделать это можно несколькими способами (выберите один):\nBootmagic:\nЗажмите верхнюю левую клавишу (в раскладке по умолчанию клавиша 9) и подключите USB кабель питания Дождитесь когда контроллер перейдёт в режим загрузчика и откроется папка-хранилище Через кнопку RESET:\nПодключите USB кабель питания и быстро нажмите кнопку RESET два раза на нижней части макропада Дождитесь когда контроллер перейдёт в режим загрузчика и откроется папка-хранилище Через кнопку BOOT:\nЗажмите кнопку BOOT на нижней части макропада и подключите USB кабель питания Дождитесь когда контроллер перейдёт в режим загрузчика и откроется папка-хранилище Скопируйте или перетащите Uf2 файл, после чего контроллер должен моментально перезагрузиться и начать работать в обычном режиме Импортируйте в программу Vial раскладку, нажав на меню “File” \u003e “Load saved layout”","устройство-макропада#Устройство макропада":"Macropad v3 кнопка RESET кнопка BOOT силиконовые ножки вспомогательное окно для разбора корпуса макропада USB-C разъем 240*280 IPS дисплей энкодер Macropad v2 кнопка BOOT кнопка RESET силиконовые ножки вспомогательное окно для разбора корпуса макропада USB-C разъем 240*280 IPS дисплей энкодер"},"title":"Macropad"},"/wired/sm30/":{"data":{"":"Space Mission 30 — механический игровой кейпад, созданный для максимального комфорта и безупречных побед","замена-свитчей--установка-хотсвап-энкодера#Замена свитчей / установка хотсвап-энкодера":"","извлечение-свитча#Извлечение свитча":"Снимите кейкап (колпачок клавиши): используйте свитч-пуллер или специальный съемник для кейкапов Извлеките старый свитч: возьмите съемник для переключателей, захватите им защелки сверху и снизу свитча и аккуратно потяните вверх, пока он не выйдет из гнезда. Your browser does not support the video tag.","извлечение-хотсвап-энкодера#Извлечение хотсвап-энкодера":"Снимите колпачок энкодера: потяните вверх колпачок Извлеките энкодер: возьмите съемник для переключателей, захватите им защелки сверху и снизу энкодера и аккуратно потяните вверх, пока он не выйдет из гнезда. Your browser does not support the video tag.","настройка-rgb-подсветки-в-vial#Настройка RGB подсветки в Vial":"В Vial во вкладке “Lighting” можно кастомизировать подсветку клавиш изменяя вид, цвет, яркость и скорость анимации\nНастройка RGB RGB Effect - позволяет выбрать различные анимации либо статичный цвет RGB Color - настройка цвета подсветки RGB Brighttless - изменение яркости подсветки RGB Speed - изменение скорости анимации подсветки После настройки всех параметров RGB подсветки нажмите Save в нижнем правом углу Vial, чтобы сохранить все изменения\nБолее подробно о функционале Vial читайте в статье","настройка-кейпада#Настройка кейпада":"","настройка-слоев-раскладок-в-vial#Настройка слоев (раскладок) в Vial":"Слои позволяют изменять функциональность кейпада в зависимости от того, на каком слое он находится в данный момент\nНазначение клавиш для переключения слоя (layers) Установите и откройте Vial или используйте веб-версию, подключите кейпад Вы можете просмотреть каждый доступный слой, щелкнув соответствующий номер в верхней части интерфейса. Layer 0 — это ваш базовый/основной слой\nВыберите слой с которого будет осуществляться активация вашего будущего слоя По умолчанию вам доступны базовый слой Layer 0 и дополнительный слой Layer 1 (активируется зажатием клавиши MO(1)) В данном примере настроим переключение с базового слоя Layer 0\nВыберите клавишу, которая будет активирорвать ваш слой и в нижнем меню перейдите во вкладку слоя (layers) Переключение между слоями может осуществляться несколькими способами. В нижнем меню выберите вкладку слоя, чтобы просмотреть все различные параметры\nВыберите интересующий метод активации слоя и номер слоя который будет задействован В данном примере рассмотрим переключение слоя через - TG(*), который активирует слой, если он неактивен, и наоборот. Ознакомитья с остальными методами переключения слоев вы можете в нашей статье. По умолчанию у нас уже есть 2 слоя с раскладкой, то в этом примере настроим 3 слой для новой раскладки, по-этому выберем TG(3), где в скобках указан номер переключаемого слоя\nВыберите редактируемый слой и назначьте клавиши/макросы на интересующие кнопки Так как мы создаем свой слой под номером 3, то выберем Layer 3 в верхней части интерфейса. Для начала назначим клавишу для деактивации нашего слоя и возврата на базовый слой Layer 0, для этого выберем ту же кнопку на раскладке и снова нажмем на TG(3) в нижней вкладке Layers\nДля примера назначим стрелочки на место W, A, S, D, для этого на нашем 3 слое поочередно выбираем место на раскладке и нажимаем на соответсвующие кнопки в нижней вкладке Basic\nP.S. Символ треугольника обозначает пропуск. Это значит, что действие при нажатии на клавишу с треугольником будет такое же, как на слое под ним. В нашем примере под нашим слоем Layer 3 будет дополнительный слой Layer 2 и нажатия на клавиши с символом треугольника будут вызывать соответствующие действия как на дополнительном слое\nПримеры использования слоёв: Отдельный слой под раскладки, которые подходят для различных типов игр Отдельный слой под макросы, которые помогают быстро отправлять сообщения во внутриигровых чатах, либо использовать комбо","перепрошивкаобновление-встроенного-по#Перепрошивка/обновление встроенного ПО":"","подготовка#Подготовка:":"Скачайте последнюю версию прошивки здесь Сохраните Вашу раскладку в программе Vial, нажав на меню “File”, дальше “Save current layout","подключение#Подключение":"Кейпад Space Mission 30 работает с устройствами под управлением Windows, macOS, Linux, Android, iOS Подключение кейпада осущевствляется посредством Plug and Play (PnP), дополнительная установка драйверов не требуется При подключении к устройству, убедитесь, что кабель USB-C плотно вставлен в разъем кейпада","создание-макросов-в-vial#Создание макросов в Vial":"Макросы позволяют отправлять несколько нажатий клавиш при нажатии только одной клавиши. Они могут делать все, что вы хотите: печатать целые предложения, повторять однотипные действия в играх\nКонфигурация Macros для создания комбо Создадим макрос, который вызывает поочередно нажатия на клавиши A, D, S, S, J\nОткройте Vial или используйте веб-версию, в верхнем меню перейдите во вкладку Macros В открывшейся вкладке вы можете просмотреть каждый доступный макрос, щелкнув соответствующий номер в верхней части интерфейса, всего доступно для создания до 109 макросов\nВыберите номер макроса, в нижнем правом углу нажмите Add action В нашем примере мы будем создавать макрос M0 через наиболее распространенный способ - Add action, который вручную добавляет действие в список\nВы так же можете использовать Tap Enter - сразу добавляет нажатие клавиши Enter для упрощения и Record macro - запись макроса прямо с клавиатуры\nВыберите нужное действие в раскрывающемся списке и назначьте клавиши для этого действия Выберем действие Tap, которое вызывает однократное нажатие на клавишу, либо комбинацию клавиш одновременно и нажмем на кнопку + (плюс) и назначим на нее клавишу A\nВам так же доступны действия Text - набор шаблонов текста для сообщений, кусков кода и т.д., Down - зажатие клавиши, либо комбинации клавиш одновременно, Up - отжатие клавиши, либо комбинации клавиш, Delay(ms) - задержка в миллисекундах между действиями в макросе\nДобавим следующее действие в макрос, аналогично предыдущему пункту Снова нажмем Add action, выберем Tap, нажмем + (плюс) и назначим клавишу. Но теперь выберем кдавишу D\nПорядок действий в макросе идет сверху вниз, учитывайте это правило при создании макросов, если нужно поменять порядок действий в макросе - используйте кнопки стрелка вверх и вниз слева от перемещаемого действия\nДобавим остальные действия в макрос и сохраним результат Аналогично 3 пункту добавим в наш макрос нажатия клавиш S, S, J\nВ конце создания макроса его нужно сохранить, нажмите кнопку Save в нижнем правом углу\nМакросы сохраняются во внутреннюю память клавиатуры и так же работают с другого ПК. При сохранении макроса Vial попросит разблокировать клавиатуру путем удержания двух клавиш в верхнем левом углу\nДобавим клавишу созданого макроса в раскладку В данном примере назначим наш макрос M0 на клавишу третьего слоя Layer 3. Перейдем во вкладку Keymap в вехнем меню, выберем 3 слой, выберем интересущую нас клавишу на раскладке и нижней вкладке Macros нажмем на кнопку M0\nВыбирайте любой удобный слой и положение клавиши для вызова макроса, как создавать слои читайте выше\nКонфигурация Macros для набора текста Для примера создадим макрос, который вызывает общий чат в игре Counter Strike 1.6, пишет текст “Hello!” и отправляет сообщение в чат\nДля реализации этого примера нужно понимать алгоритм действий, которое требуется для отправки сообщения в общий чат в игре CS 1.6. По умолчанию, нам нужно вызвать окно общего чата на клавишу Y, набрать текст сообщения и нажать Enter для отправки.\nОткройте Vial или используйте веб-версию, в верхнем меню перейдите во вкладку Macros, выберите номер макроса, в нижнем правом углу нажмите Add action В данном примере мы будем создавать макрос M1 через Add action\nДобавим действие, которое активирует игровой чат Выберем действие Tap, нажмем + (плюс) и назначим на нее клавишу Y\nДобавим задержку между вызовом окна чата и набором сообщения (иначе текст не успеет корректно напечататься) Снова нажмем Add action, выберем Delay (ms) и установим время задерки в 100 миллисекунд\nПорядок действий в макросе идет сверху вниз, учитывайте это правило при создании макросов, если нужно поменять порядок действий в макросе - используйте кнопки стрелка вверх и вниз слева от перемещаемого действия\nДобавим действие с набором текста сообщения Нажмем Add action, выберем Text и введем Hello! в поле для текста справа\nДобавим задержку между набором сообщения и отправкой в чат Нажмем Add action, выберем Delay (ms) и установим время задерки в 100 миллисекунд\nДанная задержка необязательна в данном примере, но некоторых других задачах её лучше использовать для корректной работы макроса\nДобавим действие, которое отправляет сообщение в игровой чат и сохраним макрос Нажмем Add action, выберем действие Tap, нажмем + (плюс) и назначим на нее клавишу Enter\nВ конце создания макроса его нужно сохранить, нажмите кнопку Save в нижнем правом углу\nМакросы сохраняются во внутреннюю память клавиатуры и так же работают с другого ПК. При сохранении макроса Vial попросит разблокировать клавиатуру путем удержания двух клавиш в верхнем левом углу\nДобавим клавишу созданого макроса в раскладку В данном примере назначим наш макрос M1 на клавишу третьего слоя Layer 3. Перейдем во вкладку Keymap в вехнем меню, выберем 3 слой, выберем интересущую нас клавишу на раскладке и нижней вкладке Macros нажмем на кнопку M1\nВыбирайте любой удобный слой и положение клавиши для вызова макроса, как создавать слои читайте выше\nДополнительную информацию о функции Macros можно найти в официальной QMK документации","установка#Установка":"Для перепрошивки/обновления встроенного ПО (firmware) кейпад необходимо перевести в режим загрузчика (bootloader), сделать это можно несколькими способами (выберите один):\nBootmagic:\nЗажмите верхнюю левую клавишу на второй строке (в раскладке по умолчанию клавиша Esc) и подключите USB кабель питания Дождитесь когда контроллер перейдёт в режим загрузчика и откроется папка-хранилище Через кнопку RESET:\nПодключите USB кабель питания и быстро нажмите кнопку RESET два раза на нижней части кейпада Дождитесь когда контроллер перейдёт в режим загрузчика и откроется папка-хранилище Через кнопку BOOT:\nЗажмите кнопку BOOT на нижней части кейпада и подключите USB кабель питания Дождитесь когда контроллер перейдёт в режим загрузчика и откроется папка-хранилище Скопируйте или перетащите Uf2 файл, после чего контроллер должен моментально перезагрузиться и начать работать в обычном режиме Импортируйте в программу Vial раскладку, нажав на меню “File”, дальше “Load saved layout”","установка-нового-свитча#Установка нового свитча":"Установите новый свитч: убедитесь, что контакты (пины) нового переключателя ровные и правильно совмещены с отверстиями на плате. Аккуратно вставьте его до щелчка. Верните кейкап на место Your browser does not support the video tag.","установка-хотсвап-энкодера#Установка хотсвап-энкодера":"Установите хотсвап-энкодер: убедитесь, что контакты (пины) хотсвап-энкодера правильно совмещены с контактными площадками на плате (контакты энкодера должны быть снизу). Аккуратно вставьте его до щелчка. Your browser does not support the video tag.","устройство-кейпада#Устройство кейпада":"кнопка BOOT кнопка RESET силиконовые ножки вспомогательное окно для разбора корпуса кейпада USB-C разъем дисплей место для установки MX-свитча либо хотсвап-энкодера"},"title":"Space Mission 30"},"/wired/velvet/":{"data":{"":"","настройка-клавиатуры#Настройка клавиатуры":"Пожалуйста перейдите в статью о программе Vial","обновление-прошивки#Обновление прошивки":"","подготовка#Подготовка:":"Скачайте последнюю версию прошивки здесь Сохраните Вашу раскладку в программе Vial, нажав на меню “File”, дальше “Save current layout”","подключение#Подключение":"Перед подключением к компьютеру, убедитесь, что USB-C кабель, соединяющий обе половинки между собой, плотно подключен в разъёмы на двух половинках При подключении к компьютеру, убедитесь, что кабель USB-C плотно вставлен в разъем","установка#Установка":"Левая половинка:\nЗажмите верхнюю левую клавишу и подключите USB кабель питания в левую половинку Дождитесь когда контроллер перейдёт в режим загрузчика и откроется папка-хранилище Скопируйте или перетащите Uf2 файл, после чего контроллер должен моментально перезагрузиться и начать работать в обычном режиме Импортируйте в программу Vial раскладку, нажав на меню “File”, дальше “Load saved layout” Правая половинка:\nЗажмите верхнюю правую клавишу на правой половинке и подключите USB кабель питания в правую половинку Повторите остальные пункты, как для левой половинки"},"title":"Velvet"},"/wireless/":{"data":{"":"Беспроводные девайсы работают на прошивке ZMK и настраиваются через keymap-editor\nK:03 Wireless Edition Imperial44 Wireless Edition Qube Trackball Mini Velvet Wireless Edition"},"title":"Беспроводные девайсы"},"/wireless/imperial44-we/":{"data":{"":"Imperial44 Wireless Edition - беспроводная программируемая механическая сплит-клавиатура с хотсвап-системой для быстрой замены MX-совместимых свитчей и возможностью установить по одному хотсвап энкодеру на каждую половинку","настройка-клавиатуры#Настройка клавиатуры":"Пожалуйста перейдите в статью Настройка клавиатуры в ZMK keymap-editor","обновление-прошивки#Обновление прошивки":"Прошивка для клавиатуры без Ergohaven’s Qube Скачайте reset прошивку и актуальные прошивки для левой и правой половинок\nВыключите обе половинки переключателем с обратной стороны клавиатуры\nПодключите USB кабель питания в левую половинку, дважды нажмите кнопку Reset с обратной стороны клавиатуры Дождитесь когда контроллер перейдёт в режим загрузчика и откроется папка-хранилище (если на вашем устройстве отключен автозапуск подключаемых дисков, то перейдите в папку-хранилище вручную) Скопируйте или перетащите Uf2 файл “reset прошивки”, после чего контроллер должен моментально перезагрузиться. Reset прошивка нужна для затирания внутренней памяти клавиатуры. Она сбрасывает настройки профилей подключения и синхронизации половинок\nСнова дважды нажмите кнопку Reset с обратной стороны клавиатуры и дождитесь когда контроллер перейдёт в режим загрузчика (откроется папка-хранилище) Скопируйте или перетащите Uf2 файл прошивки для левой половинки, после чего контроллер должен моментально перезагрузиться Повторите 1-5 шаги для правой половинки\nВключите обе половинки переключателем с обратной стороны клавиатуры\nОдновременно зажмите на половинках кнопки Reset с обратной стороны клавиатуры и отожмите, это синхронизирует половинки между собой\nПодключите клавиатуру к вашему устройству\nПрошивка для клавиатуры с Ergohaven’s Qube Скачайте reset прошивку и актуальные прошивки для Qube, левой и правой половинок\nВыключите обе половинки переключателем с обратной стороны клавиатуры\nПодключите USB кабель питания в Qube, дважды нажмите кнопку Reset с обратной стороны Qube\nДождитесь когда контроллер перейдёт в режим загрузчика и откроется папка-хранилище (если на вашем устройстве откючен автозапуск подключаемых дисков, то перейдите в папку-хранилище вручную)\nСкопируйте или перетащите Uf2 файл “reset прошивки”, после чего контроллер должен моментально перезагрузиться\nReset прошивка нужна для затирания внутренней памяти Qube и клавиатуры. Она сбрасывает настройки синхронизации половинок и Qube\nСнова дважды нажмите кнопку “Reset” с обратной стороны Qube и дождитесь когда контроллер перейдёт в режим загрузчика (откроется папка-хранилище) Скопируйте или перетащите Uf2 файл прошивки для Qube, после чего контроллер должен моментально перезагрузиться Подключите USB кабель питания в левую половинку, дважды нажмите кнопку Reset с обратной стороны клавиатуры Дождитесь когда контроллер перейдёт в режим загрузчика и откроется папка-хранилище (если на вашем устройстве откючен автозапуск подключаемых дисков, то перейдите в папку-хранилище вручную) Скопируйте или перетащите Uf2 файл “reset прошивки”, после чего контроллер должен моментально перезагрузиться Снова дважды нажмите кнопку “Reset” с обратной стороны клавиатуры и дождитесь когда контроллер перейдёт в режим загрузчика (откроется папка-хранилище) Скопируйте или перетащите Uf2 файл прошивки для левой половинки, после чего контроллер должен моментально перезагрузиться Повторите 1-5 шаги для правой половинки Подключите Qube к вашему устройству, дождитесь загрузки Qube Включите левую половинку переключателем с обратной стороны клавиатуры, дождитесь синхронизации половинки с Qube Важно соблюдать последовательность подключения левой и правой половинок к Qube, так как он синхронизируется поочередно сначала с левой, а затем с правой половинкой\nВключите правую половинку переключателем с обратной стороны клавиатуры, дождитесь синхронизации половинки с Qube","первое-подключение#Первое подключение":"Клавиатура Imperial44 – Wireless Edition работает с устройствами под управлением Windows, macOS, Linux, Android, iOS Подключение клавиатуры осущевствляется посредством Plug and Play (PnP), дополнительная установка драйверов не требуется Клавиатура поставляется готовой для подключения к вашему устройству с актуальной на момент покупки прошивкой Подключение напрямую (без Ergohaven’s Qube) Включите питание на левой и правой половинках клавиатуры - половинки уже синхронизированы между собой Выберите профиль подключения на клавиатуре - если нужно подключить на несколько устройств, для первого подключения можете пропустить этот шаг Подключите клавиатуру к устройству - включите Bluetooth на устройстве, затем выполните сопряжение в настройках устройства Подключение через Ergohaven’s Qube Ergohaven’s Qube — универсальный донгл для беспроводных клавиатур Ergohaven, который отображает полезную информацию и снижает энергопотребление клавиатуры\nИспользуя Type-C кабель подключите Ergohaven’s Qube к компьютеру и дождитесь загрузки Qube Включите питание на левой половинке клавиатуры - половинка автоматически подключится к Qube Включите питание на правой половинке - половинка также подключится к Qube, завершая настройку","режим-ruen#Режим Ruen":"Пожалуйста перейдите в статью RuEn раскладка для беспроводных клавиатур","устройство-клавиатуры#Устройство клавиатуры":"кнопка RESET интегрированое кольцо MagSafe для УСН силиконовые ножки вспомогательное окно для разбора корпуса клавиатуры переключатель питания клавиатуры прозрачная панель место для установки MX-свитча либо хотсвап-энкодера USB-C разъем"},"title":"Imperial44 – Wireless Edition"},"/wireless/qube/":{"data":{"":"В этом руководстве мы подробно разберем процесс полной настройки и прошивки сплит-клавиатуры Ergohaven с использованием донгла Qube. Вы узнаете, как подготовить файлы, выполнить полный сброс и правильно прошить все компоненты для стабильной работы.\nErgohaven’s Qube — это универсальный девайс создан для того, чтобы стать незаменимым помощником для беспроводных клавиатур. Работает как донгл, отображает полезную информацию, а также снижает энергопотребление вашей клавиатуры","как-обновлять-раскладку-в-будущем#Как обновлять раскладку в будущем?":"В этом заключается одно из главных преимуществ использования Ergohaven’s Qube. Вся логика раскладки клавиатуры хранится именно в нём.\nЕсли вы изменили свою раскладку (поменяли клавиши местами, добавили макрос) и собрали новую прошивку, вам не нужно заново прошивать половинки клавиатуры. Достаточно перепрошить только донгл! Просто подключите его к компьютеру, переведите его в режим загрузчика и скопируйте на него новый файл прошивки. Половинки клавиатуры трогать не нужно. Это делает процесс обновления быстрым и удобным.\nПоздравляем! Ваша клавиатура полностью настроена и готова к работе.","шаг-1-подготовка-прошивки#Шаг 1: Подготовка прошивки":"Прежде чем начать, вам нужно получить актуальные файлы прошивки. Файл прошивки — это, по сути, «мозг» вашей клавиатуры, который определяет, как она работает.\nЕсли у вас есть форк (копия) репозитория на GitHub: Синхронизируйте ваш форк с основным репозиторием ZMK, чтобы получить последние обновления. После этого соберите (скомпилируйте) прошивку и скачайте получившиеся *.uf2 файлы: по одному для левой и правой половинок, и один для донгла Qube.\nЕсли у вас нет своего форка: Скачайте готовую стандартную прошивку из репозитория ergohaven/keymap_hub Вам также понадобятся три .uf2 файла.\nДополнительно вам потребуется Reset прошивка (settings_reset-ergohaven-zmk.uf2). Обычно её можно найти там же, где и основную прошивку, или у нас в keymap_hub.","шаг-2-полный-сброс-настроек#Шаг 2: Полный сброс настроек":"Этот шаг необходим для «чистой» установки и для того, чтобы избежать конфликтов между старой и новой прошивками. Мы последовательно установим прошивку-сброса на все три устройства.\nОтключите питание на обеих половинках клавиатуры. Для этого используйте физические переключатели на нижней части корпуса. Прошейте Reset прошивкой. Подключите по очереди каждое из трёх устройств (левая половинка, правая половинка, Qube) к компьютеру. После подключения, дважды быстро нажмите кнопку сброса Reset на задней поверхности, для перевода его в режим загрузчика. Устройство появится в системе как съёмный USB-накопитель. Перетащите файл прошивки-сброса (settings_reset-ergohaven-zmk.uf2) на этот накопитель. После копирования устройство автоматически перезагрузится. Уведомление об ошибке при копировании файла прошивки или некорректном извлечении устройства - это нормально. Файл успешно передаётся, но накопитель отключается до того, как операционная система успевает подтвердить завершение операции.","шаг-3-прошивка#Шаг 3: Прошивка":"Теперь, когда все устройства сброшены, можно устанавливать основную прошивку. Порядок здесь важен!\nПрошейте Qube. Подключите донгл к компьютеру, переведите его в режим загрузчика и скопируйте на него соответствующий файл прошивки (op36_qube-ergohaven-zmk.uf2 или аналогичный). Отключите Qube от компьютера. Прошейте левую половинку. Подключите левую половинку клавиатуры, переведите её в режим загрузчика и скопируйте на неё файл прошивки для левой стороны (op36_left_qube-ergohaven-zmk.uf2). Для прошивки левой половинки клавиатуры используйте исключительно файл прошивки с названием left_qube-ergohaven-zmk.uf2. Исключением является Velvet UI - у него для левой половинки прошивка: ui_left-ergohaven-zmk.uf2, а для правой: ui_right_qube-ergohaven-zmk.uf2\nОтключите левую половинку от компьютера. Прошейте правую половинку. Подключите правую половинку, переведите в режим загрузчика и скопируйте на неё её файл прошивки (op36_right-ergohaven-zmk.uf2).","шаг-4-первое-включение-и-синхронизация#Шаг 4: Первое включение и синхронизация":"Все компоненты прошиты. Теперь их нужно правильно запустить.\nИспользуя Type-C кабель подключите Ergohaven’s Qube к компьютеру. Он будет действовать как приёмник. Включите питание на левой половинке клавиатуры. Она должна автоматически подключиться к Qube. Включите питание на правой половинке. Она также подключится к Qube, завершая настройку. Подождите несколько секунд. Попробуйте напечатать что-нибудь. Если всё сделано правильно, ваша клавиатура готова к работе!\nЕсли ничего не происходит, то нажмите один раз на кнопку сброса на Qube."},"title":"Qube"},"/wireless/tb-mini/":{"data":{"":"Trackball Mini V3 - обновленная ревизия компактного трекбола, теперь подключающегося к любым устройствам без проводов, с помощью Bluetooth, и имеющего 2 многофункциональные клавиши. Клавиши позволяют выполнять как базовые клики мыши, так и переключать режимы использования трекбола. В данном руководстве описаны все возможности трекбола, его режимы и процесс настройки.","клавиши-на-базовом-слое-трекбола#Клавиши на базовом слое трекбола":"Две новые клавиши на трекболе позволяют использовать его полностью автономно от программируемых клавиатур, ведь все действия, выполняемые с помощью мыши, доступны с помощью нажатия клавиш и нужда в отдельном слое мыши на клавиатуре полностью отпала.\nРассмотрим что клавиши умеют поподробнее.\nЛевая клавиша трекбола выполняет роль левой кнопки мыши (ЛКМ);\nПравая клавиша трекбола при кратковременном нажатии выполнит клик правой кнопкой мыши (ПКМ), а при удержании клавиши нажатой активируется “снайперский” режим, в котором скорость перемещения курсора замедляется, позволяя наводиться курсором более точно;\nОдновременное нажатие обеих клавиш производит клик средней кнопкой мыши (СКМ);\nУдержание обеих клавиш переводит трекбол в режим скролла, кручение трекбола при этом будет производить прокрутку. Прокрутка происходит как по вертикали, так и по горизонтали, в зависимости от направления кручения трекбола.","конфигурирование-трекбола#Конфигурирование трекбола":"Все режимы трекбола можно настроить в файле config/trackball.keymap, это быстро и удобно можно сделать в веб-интерфейсе GitHub, нажав кнопку Edit this file.\nОткрываем файл в вашем форке и скроллим в самый низ, ищем строки:\n\u0026trackball { cpi = \u003c1000\u003e; }; \u0026trackball_listener { input-processors = \u003c\u0026zip_xy_scaler 9 20\u003e; scroller { layers = \u003c1\u003e; input-processors = \u003c\u0026zip_xy_transform INPUT_TRANSFORM_Y_INVERT\u003e, \u003c\u0026zip_xy_scaler 1 32\u003e, \u003c\u0026zip_xy_to_scroll_mapper\u003e; }; sniper { layers = \u003c2\u003e; input-processors = \u003c\u0026zip_xy_scaler 1 4\u003e; }; adjust { layers = \u003c3\u003e; input-processors = \u003c\u0026zip_xy_scaler 1 8\u003e; }; }; Рассмотрим все доступные настройки.","настройка-клавиш-трекбола#Настройка клавиш трекбола":"На клавиши трекбола можно назначить любое поведение с помощью keymap editor.\nНапример, если вам не часто пригождается снайперский режим, но при этом вы очень часто используете режим скролла, то можно поменять их активацию местами - режим скролла активировать удержанием правой клавиши, а снайперский удержанием обеих клавиш.\nИли, если вы часто пользуетесь приложениями, где используется зажатие СКМ, то можете убрать действие при удержании комбо ЛКМ + ПКМ, назначив на него \u0026mkp MB3.","настройки-режима-скролла#Настройки режима скролла":"Для режима скролла доступны следующие настройки:\nscroller { layers = \u003c1\u003e; input-processors = \u003c\u0026zip_xy_transform INPUT_TRANSFORM_Y_INVERT\u003e, \u003c\u0026zip_xy_scaler 1 32\u003e, \u003c\u0026zip_xy_to_scroll_mapper\u003e; }; layers = \u003c1\u003e; - слои, на которых будет активен режим скролла. После изменения номера слоя надо также поменять и поведение, переключающее на слой с режимом скролла. \u003c\u0026zip_xy_transform INPUT_TRANSFORM_Y_INVERT\u003e - инвертирование скроллинга, можно инвертировать как по оси Y, так и по оси X (\u003c\u0026zip_xy_transform INPUT_TRANSFORM_X_INVERT\u003e), или даже инвертировать обе оси, перечислив параметры через запятую: \u003c\u0026zip_xy_transform INPUT_TRANSFORM_Y_INVERT\u003e, \u003c\u0026zip_xy_transform INPUT_TRANSFORM_X_INVERT\u003e,. \u003c\u0026zip_xy_scaler 1 32\u003e - скорость прокрутки задается в виде отношения, по умолчанию скорость равна одной тридцать второй. Можно как замедлить прокрутку, изменив значение, например на \u003c\u0026zip_xy_scaler 1 64\u003e, так и ускорить прокрутку \u003c\u0026zip_xy_scaler 2 32\u003e.","настройки-снайперского-режима#Настройки снайперского режима":"Для снайперского режима доступны следующие настройки:\nsniper { layers = \u003c2\u003e; input-processors = \u003c\u0026zip_xy_scaler 1 4\u003e; }; layers = \u003c2\u003e; - слои, на которых будет активен снайперский режим. После изменения номера слоя надо также поменять и поведение, переключающее на слой с снайперским режимом. \u003c\u0026zip_xy_scaler 1 4\u003e - множитель скорости для режима снайпера. По умолчанию в режиме снайпера скорость трекбола уменьшается до одной четвертой.\nАналогичным образом настраивается и замедление курсора на слое настроек (adjust).","переключение-режимов#Переключение режимов":"Режимы скролла и снайпера активируются на заданных в конфигурации слоях, по умолчанию 1 и 2 соответственно, и если вы хотите использовать эти слои с какой-то другой целью, то можно перенести активацию этих режимов на любой другой слой. О том, как изменить номера слоев для режимов, рассказано в Настройки режима скролла и Настройки снайперского режима.\nВ раскладке по умолчанию режимы переключаются с помощью поведения \u0026mo, но переключать режимы можно и любым другим поведением, активирующим слои. Если не хочется удерживать кнопку режим скролла нажатой, то для включения режима можно использовать поведение \u0026tog 1, тогда при однократном нажатии включится 1 слой вместе с режимом скролла, а при повторном нажатии 1 слой и режим скролла деактивируются.","подключение-трекбола#Подключение трекбола":"Шаг 1. Включаем Bluetooth на девайсе, к которому подключаете трекбол.\nШаг 2. Включаем трекбол, переведя переключатель питания на нижней крышке трекбола в положение ВКЛ.\nПосле этого шага трекбол перейдёт в режим сопряжения и отобразится в списке доступных для подключения, подключаем. Трекбол готов к использованию!","прошивка-мониторинг-заряда#Прошивка, мониторинг заряда":"Прошивка и мониторинг заряда происходят аналогично беспроводным клавиатурам на ZMK.","слой-настроек#Слой настроек":"Трекбол третьей версии, как и другие девайсы на ZMK, может быть привязан к 6 устройствам, и после привязки трекбол можно переключать между ними нажатием пары клавиш. Для подключения трекбола к дополнительным устройствам потребуется использовать слой настроек. Чтобы попасть на этот слой, одновременно нажмите обе клавиши трекбола два раза подряд.\nДля индикации нахождения на слое настроек, курсор на нем перемещается значительно медленнее\nКраткая сводка о действиях, доступных при нахождении на слое настроек:\nНажатие левой клавиши выберет 0 профиль подключения (первого подключенного устройства);\nНажатие правой клавиши переключит на следующий профиль подключения (всего доступно 6 профилей, счет ведется начиная с 0, заканчивая 5);\nДвойное нажатие левой кнопки очистит текущий профиль, сделав его доступным для подключения к новому устройству;\nДвойное нажатие правой кнопки очистит все профили, сделав их доступными для подключения к новым устройствам;\nОдновременное нажатие левой и правой кнопок произведет выход из слоя настроек.\nПодробнее о подключении к нескольким устройствам, и для чего использовать перечисленные функции, вы можете узнать в руководстве Первые шаги с клавиатурой на ZMK.","чувствительность-курсора-в-обычном-режиме#Чувствительность курсора в обычном режиме":"Изменить чувствительность курсора в обычном режиме можно в строке \u0026trackball { cpi = \u003c1000\u003e; };, значение cpi задается с шагом в 200, и должно быть не больше 3200.\nДополнительно к параметру cpi также применяется множитель \u003c\u0026zip_xy_scaler 9 20\u003e, означающий что итоговая чувствительность будет равна девяти двадцатых от изначального значения cpi. Это значение также можно изменять.\n\u0026trackball_listener { input-processors = \u003c\u0026zip_xy_scaler 9 20\u003e; Подробнее о доступных input-processors можно почитать в документации ZMK: https://zmk.dev/docs/keymaps/input-processors"},"title":"Trackball Mini"},"/wireless/velvet-ui/":{"data":{"":"Velvet v3 – Ultimate Interface Edition - клавиатура, уменьшающая необходимость перемещения кисти до минимума за счет изогнутого расположения клавиш и наличия трекбола под большим пальцем. Благодаря изогнутости клавиатуры перемещение пальцев между рядами клавиш происходит заметно проще, а функциональный трекбол, всегда доступный под большим пальцем, практически полностью убирает необходимость перемещения руки к мышке.","конфигурирование-трекбола#Конфигурирование трекбола":"Все режимы трекбола, включая автоматическое переключение на слой мыши, можно настроить в файле config/velvet_v3_ui.keymap, это быстро и удобно можно сделать в веб-интерфейсе GitHub, нажав кнопку Edit this file.\nОткрываем файл в вашем форке и скроллим в самый низ, ищем строки:\n\u0026trackball { cpi = \u003c1000\u003e; }; \u0026trackball_listener { input-processors = \u003c\u0026zip_auto_mouse 4 500\u003e, \u003c\u0026zip_xy_scaler 9 20\u003e; scroller { layers = \u003c5\u003e; input-processors = \u003c\u0026zip_xy_transform INPUT_TRANSFORM_Y_INVERT\u003e, \u003c\u0026zip_xy_scaler 1 32\u003e, \u003c\u0026zip_xy_to_scroll_mapper\u003e; }; sniper { layers = \u003c6\u003e; input-processors = \u003c\u0026zip_xy_scaler 1 4\u003e; }; }; Рассмотрим все доступные настройки.","настройка-переключения-на-слой-мыши#Настройка переключения на слой мыши":"Фрагмент \u003c\u0026zip_auto_mouse 4 500\u003e отвечает за автоматическую активацию слоя мыши, рассмотрим доступные настройки:\n4 - номер автоматически активируемого слоя, если вы измените раскладку слой мыши окажется с другим порядковым номером, то просто измените это значение; 500 - время, на которое активируется слой мыши. Если вы хотите выключить автоматическую активацию слоя мыши, то просто удалите фрагмент \u003c\u0026zip_auto_mouse 4 500\u003e,\nЧтобы избежать случайных активаций слоя мыши при печати, в течение 800 милисекунд после нажатия клавиш слой мыши активироваться не будет, это время также можно настроить в фрагменте, находящемся выше в файле config/velvet_v3_ui.keymap.\nzip_auto_mouse: zip_auto_mouse { compatible = \"zmk,input-processor-temp-layer\"; #input-processor-cells = \u003c2\u003e; require-prior-idle-ms = \u003c800\u003e; excluded-positions = \u003c\u003e; }; Если хотите увеличить или уменьшить этот порог, отредактируйте значение require-prior-idle-ms.\nПодробнее о настройках автоматической активации слоя мыши можно почитать в документации ZMK","настройки-режима-скролла#Настройки режима скролла":"Для режима скролла доступны следующие настройки:\nscroller { layers = \u003c5\u003e; input-processors = \u003c\u0026zip_xy_transform INPUT_TRANSFORM_Y_INVERT\u003e, \u003c\u0026zip_xy_scaler 1 32\u003e, \u003c\u0026zip_xy_to_scroll_mapper\u003e; }; layers = \u003c5\u003e; - слои, на которых будет активен режим скролла. После изменения номера слоя надо также поменять и поведение, переключающее на слой с режимом скролла. \u003c\u0026zip_xy_transform INPUT_TRANSFORM_Y_INVERT\u003e - инвертирование скроллинга, можно инвертировать как по оси Y, так и по оси X (\u003c\u0026zip_xy_transform INPUT_TRANSFORM_X_INVERT\u003e), или даже инвертировать обе оси, перечислив параметры через запятую: \u003c\u0026zip_xy_transform INPUT_TRANSFORM_Y_INVERT\u003e, \u003c\u0026zip_xy_transform INPUT_TRANSFORM_X_INVERT\u003e,. \u003c\u0026zip_xy_scaler 1 32\u003e - скорость прокрутки задается в виде отношения, по умолчанию скорость равна одной тридцать второй. Можно как замедлить прокрутку, изменив значение, например на \u003c\u0026zip_xy_scaler 1 64\u003e, так и ускорить прокрутку \u003c\u0026zip_xy_scaler 2 32\u003e.","настройки-снайперского-режима#Настройки снайперского режима":"Для снайперского режима доступны следующие настройки:\nsniper { layers = \u003c6\u003e; input-processors = \u003c\u0026zip_xy_scaler 1 4\u003e; }; layers = \u003c6\u003e; - слои, на которых будет активен снайперский режим. После изменения номера слоя надо также поменять и поведение, переключающее на слой с снайперским режимом. \u003c\u0026zip_xy_scaler 1 4\u003e - множитель скорости для режима снайпера. По умолчанию в режиме снайпера скорость трекбола уменьшается до одной четвертой.","переключение-режимов#Переключение режимов":"Режимы скролл и снайпер активируются на заданных в конфигурации слоях, по умолчанию 5 и 6 соответственно, и если вы хотите использовать эти слои с какой-то другой целью, то можно перенести активацию этих режимов на любой другой слой. О том, как изменить номера слоев для режимов, рассказано в Настройки режима скролла и Настройки снайперского режима.\nВ раскладке по умолчанию режимы переключаются с помощью поведения \u0026mo, но переключать режимы можно и любым другим поведением, активирующим слои. Если не хочется удерживать кнопку режим скролла нажатой, то для включения режима можно использовать поведение \u0026tog 5, тогда при однократном нажатии включится 5 слой вместе с режимом скролла, а при повторном нажатии 5 слой и режим скролла деактивируются.\nТакже можно сделать и гибридное кастомное поведение, которое при удержании будет включать слой поведением \u0026mo, а при кратковременном нажатии переключать его поведением \u0026tog.","управление-курсором#Управление курсором":"Главная особенность Velvet UI - встроенный трекбол, находящийся под большим пальцем, при поворотах трекбола перемещается курсор мыши и временно активируется специальный слой с клавишами мыши.\nНа слое мыши находятся клавиши для работы с курсором: левая кнопка мыши (MB1), правая кнопка мыши (MB2), клик колесом мыши (MB3), а также переключение на режимы скролла (\u0026mo 5) и снайпера (\u0026mo 6).\nСлой мыши активируется при перемещении курсора трекболом, и если в течение 500 милисекунд трекбол находится в неподвижном состоянии, то слой автоматически выключится.\nВ режиме скролла при кручении трекбола вместо перемещения курсора происходит скроллинг страницы, как по вертикали, так и по горизонтали.\nYour browser does not support the video tag. Снайперский режим уменьшает скорость перемещения курсора, позволяя более точно его наводить.\nYour browser does not support the video tag.","чувствительность-курсора-в-обычном-режиме#Чувствительность курсора в обычном режиме":"Изменить чувствительность курсора в обычном режиме можно в строке \u0026trackball { cpi = \u003c1000\u003e; };, значение cpi задается с шагом в 200, и должно быть не больше 3200.\nДополнительно к параметру cpi также применяется множитель \u003c\u0026zip_xy_scaler 9 20\u003e, означающий что итоговая чувствительность будет равна девяти двадцатых от изначального значения cpi. Это значение также можно изменять.\n\u0026trackball_listener { input-processors = \u003c\u0026zip_auto_mouse 4 500\u003e, \u003c\u0026zip_xy_scaler 9 20\u003e; Подробнее о доступных input-processors можно почитать в документации ZMK: https://zmk.dev/docs/keymaps/input-processors"},"title":"Velvet v3 – Wireless and UI Edition"},"/zmk/":{"data":{"":"ZMK — это современная прошивка для клавиатур, созданная с упором на эргономику и удобство беспроводного использования.\nС ZMK вы можете тонко настроить слои, модификаторы, макросы, поведение удержания/тапа и логику клавиш под свой рабочий процесс, игровые привычки или конкретные приложения. Она также отлично подходит для энергоэффективного «железа», обеспечивая отзывчивый набор и сохраняя фокус на времени работы от батареи."},"title":"Прошивка ZMK"},"/zmk/fork-sync/":{"data":{"":"Прошивки клавиатур постоянно дорабатываются и обновляются, и если доработки имеют общий характер и вносились в главный репозиторий ZMK, то эти обновления автоматически подтянутся при следующей сборке прошивки, например после изменения раскладки, но также периодически обновляется и репозиторий ergohaven-zmk-config, содержащий в себе раскладки и конфигурационные файлы клавиатур. Обновления могут содержать в себе, например, файлы, необходимые для сборки прошивок под новые девайсы, или же какие-то доработки в уже выпущенных устройствах, и в отличие от обновлений в ZMK, обновления в ergohaven-zmk-config автоматически не применяются, чтобы внести их в Ваш форк, необходимо провести процедуру синхронизации. О том, как провести процедуру синхронизации и будет рассказано в этом руководстве.\nПриложение GitHub является сторонним софтом, каких-то деталей его функционала автор может не знать, а также какой-то функционал с течением времени может измениться. При возникновении каких-либо вопросов или проблем пишите в сообщество Ergohaven в Telegram.","кнопка-sync-fork-не-отобразилась#Кнопка Sync Fork не отобразилась":"Чтобы начать процедуру синхронизации нажмите на ссылку с текстом “commits behind” на вкладке Code форка.\nОткроется страница “Comparing changes”, обратите внимание на выбранные по умолчанию значения:\nbase repository - по умолчанию должно быть выбрано \"{Ваш ник на GitHub}/ergohaven-zmk-config\"; base - по умолчанию должно быть выбрано “main”; head repository - по умолчанию должно быть выбрано “ergohaven/ergohaven-zmk-config”; compare - по умолчанию должно быть выбрано “main”; Если какие-то из значений отличаются, выберите значение, которое должно быть по-умолчанию.\nДалее нажмите кнопку Create pull request.\nВведите название пулл-реквеста, если оно не было заполнено автоматически, и нажмите кнопку Create pull request.\nЕсли в нижней части пулл-реквеста отобразилось сообщение “No conflicts with base branch”, то нажмите кнопку Merge pull request и ветка успешно обновлена! Можете перейти на вкладку Actions, сборка обновленной прошивки уже запущена.\nЕсли в нижней части пулл-реквеста отобразилось сообщение “This branch has conflicts that must be resolved”, то закройте созданный пулл-реквест нажатием Close pull request в нижней части страницы и перейдите к разделу Синхронизация с конфликтами слияния.","синхронизация-с-конфликтами-слияния#Синхронизация с конфликтами слияния":"Если в основном репозитории были внесены изменения в файлы, которые Вы также изменяли в своем форке, например файлы .keymap, в которых хранятся раскладки клавиатур, то при обновлении форка могут возникнуть конфликты слияния, далее описаны шаги для их решения.\nНа вкладке Code нажмите кнопку Branches. Нажмите New branch. В появившемся окне введите название ветки, например “sync”, затем в выпадающем списке выберите репозиторий “ergohaven/ergohaven-zmk-config”, по умолчанию должна быть выбрана ветка “main”, и нажмите Create new branch. Далее в строке созданной ветки нажмите ••• и в открывшемся выпадающем списке выберите New pull request. Нажмите на base repository и выберите в выпадающем списке форк \"{Ваш ник на GitHub}/ergohaven-zmk-config\". На открывшейся странице “Comparing changes” нажмите кнопку Create pull request. В зависимости от количества синхронизируемых коммитов кнопка Resolve conflicts может быть не видна сразу, пролистайте до нее и нажмите. Откроется инструмент для разрешения конфликтов, в левой части страницы отображена панель с списком файлов, конфликты в которых надо разрешить, а в правой части содержимое файлов с отмеченными местами конфликтов. Между \u003c\u003c\u003c\u003c\u003c\u003c\u003c sync (“sync” в данном примере это название созданной ветки) и ======= находятся изменения из основного репозитория “ergohaven/ergohaven-zmk-config”, вызвавшие конфликт. Между ======= и \u003e\u003e\u003e\u003e\u003e\u003e\u003e main находятся изменения, внесенные Вами в раскладку.\nДалее необходимо внимательно рассмотреть каждый конфликт и решить, хотите ли вы внести в свою раскладку изменения, предложенные из “ergohaven/ergohaven-zmk-config”. Если Вы понимаете, что изменение из основного репозитория Вам не нужно, то удалите строки, начиная с \u003c\u003c\u003c\u003c\u003c\u003c\u003c sync и заканчивая =======, затем пролистайте файл до строки \u003e\u003e\u003e\u003e\u003e\u003e\u003e main, означающей окончание данного конфликта, и также сотрите эту строку. Конфликт разрешен. Your browser does not support the video tag. Если Вы понимаете, что изменение из основного репозитория Вам нужно, то удалите строку \u003c\u003c\u003c\u003c\u003c\u003c\u003c sync, строку ======= и строку \u003e\u003e\u003e\u003e\u003e\u003e\u003e main, тем самым добавляя изменение из основного репозитория к раскладке. Конфликт разрешен. Your browser does not support the video tag. Если Вы не понимаете, или не уверены, что делает какое-то изменение из основного репозитория, то обратитесь за помощью с разрешением конфликта в Сообщество Ergohaven в Telegram. После разрешения всех конфликтов в файле станет доступна кнопка Mark as resolved, нажмите ее чтобы завершить разрешение конфликтов в файле. После разрешения конфликтов во всех файлах отобразится кнопка Commit merge, нажмите ее для завершения. Пролистайте страницу до кнопки Merge pull request, нажмите ее, и затем нажмите Confirm merge.\nПоследним шагом для того, чтобы удостовериться, что все конфликты разрешены перейдите на вкладку Actions, дождитесь завершения сборки прошивки. Если конфликты разрешены корректно, то сборка прошивки успешно завершится.","синхронизация-форка#Синхронизация форка":"О необходимости синхронизировать форк вы можете узнать по появлению ссылки с текстом “commits behind” на вкладке Code форка, в обычных условиях при этом также должна появиться кнопка Sync fork, если ее нет, то перейдите к разделу Кнопка Sync Fork не отобразилась.\nДля синхронизации нажмите кнопку Sync fork.\nВ появившемся окне нажмите кнопку Update branch и все, форк успешно синхронизирован, все изменения из основного репозитория уже в вашем форке.\nЕсли после нажатия Sync fork отобразилось окно с заголовком “This branch has conflicts that must be resolved”, то есть 2 варианта синхронизации:\nОтбросить все внесенные Вами в форк изменения, ВНИМАНИЕ при этом раскладка в Вашем форке вернется к стандартной, так что делайте это, только если уверены, что можете без проблем восстановить все свои изменения. Для отбрасывания изменений с синхронизацией форка нажмите Discard commits. Решить конфликты слияния. Решение конфликтов описано в разделе Синхронизация с конфликтами слияния."},"title":"Синхронизация форка ergohaven-zmk-config в GitHub"},"/zmk/keymap-editor/":{"data":{"":"Keymap-editor — это мощный инструмент для настройки клавиатуры на ZMK, позволяющий удобно и быстро воплотить идею в готовую раскладку. В статье описана процедура подключения keymap-editor и основные возможности с точки зрения как нового пользователя, только начинающего погружение в мир сплит-клавиатур, так и уже знакомого с сплит-клавиатурами и настройкой раскладки в Vial.","custom-behaviors#Custom Behaviors":"В этом разделе мы можем создать своё кастомное Поведение, основанное на стандартных. Создадим Поведение, с которым будет удобно реализовать Home Row Mods (далее HRM), популярный подход к дизайну раскладки, основная идея которого состоит в том, что на клавиши домашнего ряда (A, S, D, F и J, K, L, ;), при удержании нажатыми, активируют модификаторы Shift, Ctrl, Gui или Alt.\nНажмём Add New Behavior, в открывшемся окне выберем Hold or Tap behavior.\nВ этом окне надо описать шаблон того, какие Поведения будут выполнены при нажатии и удержании, а также несколько свойств. Заполним свойства:\nBind: “hrm”. Название поведения, именно по нему мы можем найти Поведение при назначении на клавишу; bindings — HOLD: \u0026kp. При удержании клавиши нажатой будет нажиматься клавиша с модификатором, для этого подойдет обычный \u0026kp; bindings — TAP: \u0026kp. Действие при кратковременном нажатии, для того чтобы нажать клавишу с буквой также подойдет \u0026kp; tapping-term-ms: 200. Если клавиша будет нажата менее чем 200 миллисекунд, то клавиатура зарегистрирует TAP и нажмётся клавиша, например D, если клавиша будет удержана нажатой более чем 200 миллисекунд, то зарегистрируется HOLD и нажмётся указанный в параметрах модификатор, например Ctrl.; flavor: balanced. Есть несколько алгоритмов, позволяющих пользоваться HRM не завязываясь строго на тайминг из tapping-term-ms, balanced это как раз один из них, он подразумевает, что если HRM клавиша была нажата менее чем 200 миллисекунд, но за время нажатия HRM клавиши была нажата и отпущена другая клавиша, то надо зарегистрировать действие HOLD. В документации ZMK есть пример создания HRM, не зависящего от таймингов полностью, не мешая технике печати и перекатам по клавишам. Идея состоит в том, что модификаторы строго нажимаются на одной половинке, а клавиша с буквой на другой половинке. В примере описаны свойства в виде кода, но в keymap-editor все свойства имеют такие же наименования и их легко адаптировать.\nПосле заполнения свойств нажимаем Okay, и видим что наше кастомное Поведение было успешно создано.\nДалее перейдём на вкладку Layers, и назначим созданное поведение на клавишу D. В окне назначения Поведения нам надо найти и выбрать созданный \u0026hrm.\nЗаполним параметры:\nВ Parameters — HOLD надо указать кей-код желаемого модификатора, укажем Ctrl. В Parameters — TAP надо указать кей-код клавиши, отправляемой по тапу, выберем D. Интересной идеей может быть назначение HRM модификатора Ctrl на клавишу S, ведь тогда нажимать очень часто используемые сочетания Ctrl + C и Ctrl + V очень удобно одной рукой, попробуйте!\nПосле заполнения параметров жмём Okay и наш первый Home Row Mod назначен!\nАналогичным образом назначаем HRM модификаторы на все остальные клавиши, и все модификаторы уже лежат под пальцами, чтобы их достать больше не надо смещать руку.\nСовет: можно создать несколько Поведений с разным Tapping Term для разных пальцев. Например, для мизинца (который слабее указательного) стоит задать большее значение Tapping Term, чтобы случайные нажатия не регистрировались как HOLD.","lt#\u0026amp;lt":"\u003c — гибридное Поведение стандартного нажатия на клавишу (\u0026kp) и активации слоя при удержании клавиши нажатой (\u0026mo). Например, на красную клавишу, на которой в стандартной раскладке \u0026mo 1, назначим \u003c, передав в параметры: 1-й слой и кей-код Space, и тогда при нажатии на нее будет печататься пробел, а при удержании будет происходить изменение слоя, чистая магия!\nСтоит заметить, что таким образом мы сократили количество занятых клавиш на 0-м слое, ведь изначально \u0026kp Space и \u0026mo 1 были на двух отдельных клавишах, нажимаемых большим пальцем, а теперь мы объединили их в одну, и теперь можно расположить на месте \u0026kp Space какое-нибудь другое Поведение.","mo#\u0026amp;mo":"\u0026mo — активирует указанный слой при удержании клавиши нажатой. Именно это Поведение используется в стандартной раскладке, на красной клавише назначено \u0026mo 1, и при удержании её зажатой активируется 1-й слой.","mod-morph#\u003ccode\u003e\u0026amp;mod-morph\u003c/code\u003e":"Mod Morph позволяет добавить свою кастомную обработку нажатия клавиши, если она нажата с активными модификаторами Shift, Ctrl, Alt или Gui.\nЕсли назначить Mod Morph со скриншота на клавишу, то при нажатии без модификаторов нажмётся Q, а при зажатом модификаторе Alt — Esc. Вместо Esc может быть любое Поведение, например изменение слоя, или макрос!\nЭто поведение является более гибким аналогом Key Overrides из Vial.","mt#\u003ccode\u003e\u0026amp;mt\u003c/code\u003e":"Поведение Mod/Tap позволяет назначить определённое Поведение на короткое нажатие (TAP) клавиши, и другое Поведение на зажатие (HOLD) клавиши. (Аналог клавиш LShift_T, LCtrl_T и т.д. с вкладки Quantum из Vial)\nПо умолчанию коротким нажатием считается нажатие, длящееся менее 200 миллисекунд, если зажали дольше, то регистрируется зажатие.\nЕсли настроить Поведение как на скриншоте выше, то при коротком нажатии клавиши напечатается буква D, а при зажатии — будет зажат левый Shift.","reconfigurations#Reconfigurations":"Здесь мы можем изменить свойства стандартных Поведений, например тех, которые были описаны в разделе Слои.\nНажмём кнопку Add Behavior Reconfiguration, в открывшемся меню выберем, например \u0026sl.\nВ открывшемся окне Reconfigure \u0026sl видим ряд стандартных свойств, которые мы можем изменить. Давайте увеличим таймаут для \u0026sl, чтобы слой оставался активным не 1 секунду, а 3, для этого в строке свойства release-after-ms кликаем кнопку Override и в появившемся поле вводим 3000 (единицы измерения в поле — миллисекунды), и нажимаем Okay.\nВ разделе Reconfigure появилась запись \u0026sl с переопределёнными свойствами. Для просмотра свойств надо нажать кнопку Edit. Чтобы полностью вернуть свойствам стандартные значения нажмите кнопку Delete.\nПодробная информация о всех свойствах Поведений в документации ZMK.","sk#\u003ccode\u003e\u0026amp;sk\u003c/code\u003e":"При нажатии Sticky Key задерживает клавишу нажатой, и отпускает её после следующего нажатия любой другой клавиши. (Аналог OSM из Vial)\nУдобно использовать с модификаторами, назначив \u0026sk LShift, не надо зажимать клавишу Shift, чтобы напечатать заглавную букву, а просто один раз нажать \u0026sk LShift и сразу отпустить, следующая буква уже будет заглавной","sl#\u0026amp;sl":"\u0026sl — при нажатии включает слой, указанный в параметре, но лишь на одно нажатие. (аналог OSL() из Vial)\nУдобно использовать это Поведение для переключения на слой с функциональными клавишами, ведь чаще всего их требуется нажать 1 раз. Нажали \u0026sl 3 (на этом слое в раскладке по умолчанию F1-12 клавиши), слой включился, нажали клавишу F1, и слой сразу же автоматически выключился.\nТакже важно упомянуть, что если после переключения на слой через \u0026sl в течение 1 секунды не произойдет нажатия, то слой автоматически выключится. Этот таймаут конфигурируется в разделе Behaviors -\u003e Reconfiguration, подробнее в разделе Behaviors.","td#\u003ccode\u003e\u0026amp;td\u003c/code\u003e":"Tap Dance назначает разное Поведение в зависимости от того, сколько раз подряд клавиша была нажата.\nЕсли назначить Tap Dance со скриншота на клавишу, то при однократном нажатии напечатается буква Q, а при двукратном нажмётся Esc.\nС помощью комбинации этого поведения и \u0026mt возможно сделать клавишу, аналогичную Tap Dance из Vial.","to#\u0026amp;to":"\u0026to — при нажатии включает слой, указанный в параметре, и выключает все остальные активные слои.\nЭто Поведение очень удобно для переключения на слой по нажатию, ведь в отличие от \u0026tog, Поведение \u0026to выключает все активные слои, и нет необходимости отдельно выключать текущий активный слой. Пример: находясь на 0-м слое нажат \u0026to 2 — слой 2 включается, мы можем переключиться на 1-й слой нажатием \u0026to 1, ведь это поведение помимо включения слоя 1, выключает все остальные активные слои, в данном случае 2-й.","tog#\u0026amp;tog":"\u0026tog — при нажатии переключает состояние слоя, то есть включает указанный слой, если он выключен, и наоборот, выключает его, если он включен. (аналог TG() из Vial) При использовании этого Поведения стоит помнить что активным на данный момент является включенный слой с самым большим номером, то есть, включив слой нажатием \u0026tog 2, невозможно переключиться на 1-й слой нажатием \u0026mo или \u0026tog, ведь он имеет меньший номер, и несмотря на то что нажатие \u0026tog 1 включит 1 слой, активным всё равно останется 2-й слой т.к. он имеет больший номер. Чтобы переключиться на слои с номером ниже на 2-м слое надо расположить клавишу \u0026tog 2.\nДля закрепления пошагово разберем сценарий работы с \u0026tog:\nНаходясь на 0-м слое нажат \u0026tog 2 — слой 2 включен, переключиться на 1-й слой нажатием \u0026tog 1 или \u0026mo 1 не получится; Находясь на 2-м слое нажат \u0026tog 2 — слой 2 выключен, клавиатура вернулась на 0-й слой, и мы можем переключаться на 1-й слой.","быстрое-назначение-клавиш#Быстрое назначение клавиш":"На любом слое можно быстро переназначить клавиши, нажав на кнопку … рядом с названием слоя и выбрав Quick \u0026kp Assignment.\nYour browser does not support the video tag. В открывшемся окне удобно назначать нажатия цифр, букв, и функциональных клавиш","вкладка-behaviors#Вкладка Behaviors":"На вкладке Behaviors можно создать свои кастомные Поведения и настроить стандартные. Начнем с настройки стандартных.","комбо#Комбо":"Комбо позволяет назначить Поведение на одновременное нажатие нескольких клавиш. Например, можно назначить на одновременное нажатие клавиш C и V переключение раскладки клавиатуры, или какой-нибудь макрос, часто это удобнее назначения клавиши в слое.\nДля создания Комбо перейдем на вкладку Combos и нажмём Add New Combo.\nРассмотрим пример с Комбо клавиш C и V для изменения языка раскладки. В открывшемся окне нам надо выбрать позиции клавиш, нажатие на которые приведет к активации комбо, для этого просто кликаем на позиции, которых находятся клавиши C и V.\nЗаполняем название комбо (на скриншоте “lang”), и выбираем Поведение при активации комбо, для изменения языка раскладки подойдет \u0026kp, нажимающий Space с зажатым модификатором GUI.\nНажимаем на кнопку Create и комбо готово к использованию!\nНажав на кнопку с гаечным ключом мы можем внести дополнительные настройки для Комбо, например изменить таймаут срабатывания, или указать на каких конкретно слоях Комбо будет работать (по умолчанию комбо работают на всех слоях). Подробнее о этих настройках можно почитать в документации ZMK.","копирование-слоёв#Копирование слоёв":"Еще одной полезной возможностью управления слоями является их копирование.\nЧтобы сделать копию надо нажать на кнопку … рядом с названием слоя и выбрать Duplicate Layer. После нажатия будет создана полная копия слоя.","макросы#Макросы":"С помощью Макросов можно сохранить какую-то часто используемую последовательность сочетаний клавиш и вызывать эту последовательность нажатием всего одной клавиши, например сделать Макрос, печатающий различные шаблоны, вроде такого:\n```\n```\nв конце макрос может еще и переместить курсор в середину этого шаблона, экономит очень много нажатий!\nСоздание такого Макроса и разберем для примера.\nПереходим на вкладку Macros, и нажимаем Add New Macro. В открывшемся окне вводим название Макроса, для примера введём “template” и нажмём Create.\nДалее нам надо составить действия, которые выполнит Макрос. Чтобы макрос трижды напечатал символ `, трижды используем Поведение \u0026kp. При создании макроса ячейка под одно Поведение сразу добавляется, добавим еще 2, дважды нажав кнопку Add Key Binding, и во всех трёх ячейках назначим \u0026kp `.\nДалее нам надо дважды сделать перенос на новую строку, снова трижды написать символ ` и последним шагом нажать клавишу ↑, чтобы перенести курсор в центр шаблона.\nИтого получается 9 нажатий, целых 9 нажатий сокращается до всего 1!\nПо умолчанию ZMK будет нажимать каждую клавишу 30 мс, и между каждым нажатием будет происходить пауза 15 мс, чтобы ОС успевала обрабатывать каждое нажатие. Чтобы действия точно сработали (во всяких тормозных корпоративных мессенджерах, удалённых рабочих столах и джирах), а также чтобы совершаемые Макросом действия были немного читаемее, разделим их на группы добавив дополнительную паузу в 10 мс, для этого нажмём Add Control Binding и перенесём появившийся ¯o_press после первых трёх нажатий `. Теперь надо не забыть поменять ¯o_press на ¯o_wait_time, для этого кликнем на него и выберем ¯o_wait_time, в параметре Raw Value укажем 10, это количество миллисекунд, которое подождет макрос.\nТакой задержки может не хватить при работе на удаленных рабочих столах, и если так случится, то можно увеличить время каждого нажатия и задержку в параметрах макроса, они открываются при нажатии на кнопку с иконкой гаечного ключа.\nВыглядит уже читаемее, добавим такие же ¯o_wait_time после двух нажатий Enter и после второй группы нажатий `.\nКрасота, теперь наглядно понятно, что Макрос делает.\nНам осталось только назначить Макрос на клавишу или Комбо, и можно использовать!\nМакрос является Поведением, и выбирать его надо именно в поле Behavior.","начало-работы-с-keymap-editor#Начало работы с keymap-editor":"Keymap-editor является веб-приложением, он доступен из браузера по адресу https://nickcoutsos.github.io/keymap-editor/. Чтобы им воспользоваться, требуется выполнить несколько условий:\nПользователь должен быть зарегистрирован на https://github.com/ Пользователю нужен форк репозитория https://github.com/ergohaven/ergohaven-zmk-config В форке надо включить GitHub Actions для автоматической сборки прошивки после внесения изменений в раскладку, переходим на вкладку Actions и нажимаем кнопку I understand my workflows, go ahead and enable Actions.\nПереходим на страницу https://nickcoutsos.github.io/keymap-editor/, на открывшейся странице выбираем GitHub, авторизуемся и предоставляем доступ к созданному форку для Keymap Editor. Для предоставления доступа отмечаем опцию Only select repositories, и выбраем Ваш форк репозитория /ergohaven/ergohaven-zmk-config. Далее нажимаем Save для сохранения настроек доступа.\nКогда описанные выше шаги выполнены, раскладка готова к внесению изменений, ура! Переходим на страницу https://nickcoutsos.github.io/keymap-editor/ и видим раскладку по умолчанию.","несколько-полезных-behaviors#Несколько полезных Behaviors":"","параметризованные-макросы#Параметризованные макросы":"У Макросов в ZMK есть интересная особенность, их можно сделать параметризованными. Для использования параметров надо применить один или несколько из перечисленных Control Bindings:\n¯o_param_1to1 — следующему Поведению в макросе, в качестве параметра 1 будет передано значение из параметра 1 Макроса; ¯o_param_1to2 — следующему Поведению в макросе, в качестве параметра 2 будет передано значение из параметра 1 Макроса; ¯o_param_2to1 — следующему Поведению в макросе, в качестве параметра 1 будет передано значение из параметра 2 Макроса; ¯o_param_2to2 — следующему Поведению в макросе, в качестве параметра 2 будет передано значение из параметра 2 Макроса. Рассмотрим на примере, реализовав Макрос, который при нажатии активирует переданный в параметре слой, нажимает переданный в параметре модификатор, ждёт отпускания клавиши, а затем выключает переданный слой и отпускает переданный в параметре модификатор.\nНазовём Макрос \u0026ml (mod-layer), он будет выглядеть вот так:\nВыбраны ¯o_param_1to1 и ¯o_param_2to1 так как используемые Поведения \u0026mo и \u0026kp имеют по одному входному параметру.\nСтоит обратить внимание на то, как Макрос назначается в раскладке. В списке Behavior находим созданный Макрос \u0026ml, выбрав его нам необходимо заполнить параметры:\nLayer — это слой, который передастся в качестве параметра для \u0026mo, выберем 2; Key Code — это клавиша, передаваемая в \u0026kp, она будет нажата одновременно с \u0026mo, мы планировали использовать модификатор, так что выберем LShift. Всё, макрос готов к использованию! Прелесть такого макроса в том, что его можно использовать в нескольких местах раскладки, указывая любой слой, на который надо переключиться, и любой модификатор.\nПри создании кастомного Hold or Tap behavior, в bindings — HOLD и TAP можно указать любые Поведения, даже параметризованные макросы — это очень гибко, ведь при удержании клавиши выполнятся любые действия, какие только в голову придут, например в документации ZMK есть вот такая идея: параметризованный макрос, в котором при активации слоя одновременно меняется и цвет RGB-подсветки на заданный в параметре, то есть, вероятно, после переезда K:03 и Imperial на рельсы ZMK будет доступен выбор цвета светодиода для разных слоев! А ведь можно скомбинировать это не только со слоями, а с чем угодно, даже с модификаторами!","переименование-слоёв#Переименование слоёв":"Слоям можно изменять названия, это может облегчить конфигурирование раскладки, для этого наводим курсор на название слоя и нажимаем кнопку Edit с иконкой карандаша.","переключение-слоёв#Переключение слоёв":"В ZMK для переключения слоев есть несколько Поведений:","перемещение-слоёв#Перемещение слоёв":"Иногда при настройке раскладки возникает необходимость перемещения целого слоя на другую позицию, в keymap-editor это реализовано очень удобно, достаточно просто перетащить слой на нужную позицию.\nYour browser does not support the video tag. При перемещении слоя таким образом, keymap-editor автоматически подстраивает параметры всех Поведений, ранее активировавших этот слой, например, в раскладке есть \u0026mo 2, если переместить 2-й слой на позицию 1-го слоя, то назначенная клавиша \u0026mo 2 автоматически изменится на \u0026mo 1.","переназначение-клавиш#Переназначение клавиш":"Чтобы переназначить какую-то клавишу, кликаем на нее, и откроется окно выбора нового Поведения этой клавиши.\nВ окне надо выбрать Behavior (далее Поведение) для этой клавиши. Поведение — это сущность в ZMK, определяющая какое именно действие будет произведено при нажатии клавиши, например \u0026kp (Key Press) просто отправляет в ОС нажатие клавиши. Каждый \u0026kp имеет параметр Key Code, в котором мы указываем какая конкретно клавиша будет нажата, на скриншоте выше в этом параметре указана клавиша Q. Если мы хотим назначить вместо Q, например, Z, то надо кликнуть на поле Key Code.\nОкно разворачивается и в правой части отображается список доступных для назначения кей-кодов. В поисковую строку доступных кей-кодов вводим Z, выбираем Z среди отфильтрованных кодов, нажимаем Okay и готово, клавиша заменена!\nНад списком кейкодов есть чекбоксы с модификаторами Shift, Alt, Ctrl и Gui, с префиксами “L” и “R”, обозначающими левый или правый модификатор. Если отметить один из чекбоксов модификаторов, то в ОС отправится сочетание клавиш с отмеченным модификатором. Например, если бы в окне выше мы отметили чекбокс LCtrl, то при нажатии на клавишу сразу отправилось бы сочетание LCtrl + Z. Удобно, нажатием одной клавиши сразу делаем сочетание клавиш!\nДалее внесенные изменения надо сохранить, нажимаем Save в левом верхнем углу, при желании можно дать название внесенному изменению чтобы при просмотре истории было понятно какие изменения в раскладку были внесены, или оставить поле пустым и нажать Commit.\nПрошивка автоматически начала собираться, обычно этот процесс занимает около двух минут. Нажмём на синюю кнопку с статусом сборки.\nНа открывшейся странице отображены статусы всех этапов сборки. После выполнения всех этапов появится раздел Artifacts, содержащий архив firmware, кликаем на него для скачивания.\nПосле скачивания архива firmware прошиваем файлами из него клавиатуру по шагам, описанным в первых шагах с клавиатурой на ZMK (см. раздел «Прошивка клавиатуры»).\nИзменения в раскладку внесены!","полезные-кастомные-behaviors#Полезные кастомные Behaviors":"Для создания клавиш с перечисленными ниже Поведениями надо создать новое кастомное Поведение с соответствующим типом.","слои#Слои":"В сплит-клавиатурах используются слои, это своего рода дополнительные модификаторы, как Shift или Control, и переключив клавиатуру на другой слой, нажатия клавиш будут регистрировать уже другие символы или функции, назначенные на эту клавишу на этом слое.\nЗвучит сложно, надо рассмотреть на примере:\nЕсли нажать и не отпускать красную клавишу на левой половинке, то клавиатура переключится на 1 слой, и нажав, например, клавишу W, в ОС отправится нажатие клавиши 2, т.к. в раскладке по умолчанию она назначена на позицию W на 1-м слое.","цикл-выполнения-макроса#Цикл выполнения макроса":"Макросы в ZMK выполняются в 2 шага:\nДействия при нажатии макроса, Действия при отпускании макроса. Изначально это не заметно, ведь без определённого Control Binding все действия выполняются сразу при нажатии. Чтобы научиться разграничивать эти 2 шага нам пригодятся следующие Control Bindings:\n¯o_press — для последующих нажатий устанавливает режим, при котором указанная клавиша будет нажата, но не будет отпущена; ¯o_release — для последующих нажатий устанавливает режим, при котором указанная клавиша будет отпущена; ¯o_tap — для последующих нажатий устанавливает режим, при котором указанная клавиша будет нажата, и по прошествии времени, указанном в tap_time, будет отпущена (режим по умолчанию); ¯o_tap_time — задаёт время между нажатием и отпусканием каждой клавиши в макросе (по умолчанию 30 мс); ¯o_pause_for_release — на этом месте Макрос остановит своё выполнение до момента, когда клавиша Макроса будет отпущена. Применив перечисленные Control Bindings можно составить макрос, который при нажатии переключает слой, нажимает определенный модификатор, затем ожидает отпускания макроса, и после этого уже возвращает слой обратно и отпускает модификатор. Получается клавиша, объединяющая \u0026mo и \u0026kp, два в одном!"},"title":"Настройка клавиатуры в ZMK keymap-editor"},"/zmk/zmk-keyboards/":{"data":{"":"В статье содержится руководство, которое поможет сделать первые шаги в освоении клавиатуры на ZMK. Прочитав статью пользователь научится: управлять питанием клавиатуры, подключать клавиатуру к нескольким устройствам и обновлять прошивку.","выключение-клавиатуры#Выключение клавиатуры":"Выключить клавиатуру можно переключателем на задней стороне клавиатуры, переведя его в положение Off, а также выключение можно настроить непосредственно на клавишу клавиатуры, назначив на неё \u0026SOFT_OFF. При нажатии на эту клавишу обе половинки клавиатуры переведутся в выключенное состояние, чтобы пробудить её, надо нажать кнопку Reset на нижней стороне клавиатуры.","зарядка-батареи#Зарядка батареи":"Для зарядки устройства переключатель снизу устройства должен быть в положении I (вкл) Используйте стандартный кабель USB-C (идет в комплекте) Заряжайте устройство через USB порт ПК (продолжительность зарядки ~2 часа), либо можете использовать блок питания на 5В Во время зарядки так же можно пользоваться устройством","переход-в-состояние-сна#Переход в состояние сна":"Спустя 10 минут бездействия клавиатура переходит в режим сна для экономии заряда. Для пробуждения из сна достаточно нажать любую клавишу, и клавиатура проснётся через пару секунд.","подключение-к-нескольким-устройствам#Подключение к нескольким устройствам":"Для беспроводного подключения клавиатура может запомнить до 5 устройств, каждое подключенное устройство привязывается к выбранному “профилю” после подключения.\nДля подключения ко второму устройству надо нажать клавишу \u0026BT_SEL 1, клавиатура станет доступна для сопряжения, подключаемся к ней с устройства.\nЧтобы снова подключиться к первому устройству нажимаем \u0026BT_SEL 0, устройство автоматически увидит клавиатуру и подключится к ней. Аналогично можно подключить устройства к профилям 3, 4, 5.\nДля отвязки клавиатуры от вашего устройства на текущем профиле выполните следующие шаги:\nочистить профиль на клавиатуре нажатием \u0026BT_CLR, затем в параметрах Bluetooth на вашем устройстве отвязать клавиатуру, и перезапустить Bluetooth на вашем устройстве. После выполнения этих шагов клавиатура должна быть полностью отвязана от вашего устройства на текущем профиле.","подключение-клавиатуры#Подключение клавиатуры":"Если при подключении клавиатуры к вашему устройству возникли какие-то неполадки, попробуйте перезагрузить Bluetooth на вашем устройстве и пройти все описанные ниже шаги заново.\nШаг 1. Для начала включаем её, переключив физический тумблер в положение “On”.\nШаг 2. Далее половинки надо соединить между собой, для этого одновременно на обоих половинках нажимаем кнопку “Reset”, находящуюся на дне.\nШаг 3. Когда клавиатура включена и половинки соединены можно переходить к подключению. Для начала стоит убедиться, что текущий профиль подключения очищен, нажав \u0026BT_CLR (в раскладке по умолчанию клавиши управления профилем расположены на 3 слое, переключиться на него можно, зажав клавиши переключения на слои 1 и 2), это сбросит привязанные к профилю устройства.\nШаг 4. Далее, для подключения к устройству по Bluetooth надо нажать клавишу выбора профиля, например \u0026BT_SEL 0.\nШаг 5. После нажатия клавиатура перейдёт в режим сопряжения и отобразится в списке доступных для подключения, выбираем её, и, вуаля, всё работает!\nP.S. Если клавиатура работает некорректно, например, с одной половинки нажатия клавиш не доходят до устройства, то стоит повторно провести процедуру соединения половинок, одновременно нажав клавишу Reset на обоих.","подключение-по-проводу#Подключение по проводу":"При подключении клавиатуры к устройству проводом, клавиатура автоматически начинает передавать данные по проводу. После отключения провода клавиатура вернётся в режим передачи данных по Bluetooth.\nВ ситуациях, когда клавиатура подзаряжается от одного устройства, но необходимо передавать данные в другое, можно нажать клавишу \u0026OUT_BLE, это принудительно переведет клавиатуру в режим передачи по Bluetooth и данные будут отправляться в устройство, привязанное к текущему профилю.","прошивка-клавиатуры#Прошивка клавиатуры":"Обновление прошивки клавиатуры происходит следующим образом:\nПодключаем половинку клавиатуры по проводу; Дважды нажимаем клавишу Reset на нижней стороне клавиатуры (пауза между нажатиями должна быть минимальной); Аналогично с прошивкой клавиатур на QMK, в ПК определяется новый съемный диск, в него надо положить файл прошивки; Отсоедините кабель; Но обоих половинках одновременно нажмите кнопки Reset, находящиеся на дне, чтобы соединить половинки. Важно! Прошивки половинок имеют различия, и прошивать левую половинку надо файлом, название которого оканчивается на left.uf2, а правую половинку файлом, оканчивающимся на right.uf2. В большинстве случаев достаточно прошивать только главную половинку (правую для Velvet v3 UI edition, левую для OP36 и Velvet v3) так как раскладка хранится в ней.\nПереводить клавиатуру в режим прошивки можно не только двойным нажатием Reset, это также можно делать нажатием клавиши \u0026bootloader. Нажатие \u0026bootloader переводит в режим прошивки только ту половинку, на которой была нажата.\nБольше информации в документации ZMK: https://zmk.dev/docs","состояние-батареи#Состояние батареи":"Текущий заряд главной (правая для Velvet v3 UI edition, левая для OP36 и Velvet v3) половинки отображается в ОС, в списке подключеных Bluetooth устройств. Заряд второстепенной половинки в нормальных условиях тратится медленнее главной, точный зяряд можно увидеть только с помощью дополнительного софта. Есть несколько вариантов софта под разные ОС:\nZMK Battery Center - доступно на Windows, MacOS; Mighty-Mitts - доступно только на MacOS; ZMK Split Battery - доступно только на Windows; zmkBATx - доступно только на Linux."},"title":"Первые шаги с клавиатурой на ZMK"},"/zmk/zmk-ruen/":{"data":{"":"Если вы хотя бы раз задавались вопросом, почему на русском и английском языках такие частые символы как точка и запятая расположены на разных клавишах, или почему на русском нельзя напечатать фигурную скобку, подход RuEn позволяет решить это недоразумение, унифицируя положение символов на русской и английской раскладке.\nРасположить символы можно одинаково и на любом другом языке, русским и английским языками подход не ограничен.","caps-word-на-русской-раскладке#Caps Word на русской раскладке":"В ZMK есть встроенное поведение Caps Word, на данный момент оно отлично работает на английском языке, но, к сожалению, с русскими буквами возникают проблемы, ведь буква “Б” расположена на клавише DOT, и хоть мы и можем настроить, чтобы Caps Word не прерывался после нажатия этой буквы, но заглавную “Б” с штатны Caps Word напечатать не получится. Однако есть возможность имитировать эту функцию с помощью слоёв.\nДля воссоздания поведения Caps Word потребуется:\nПродублировать слой ru, удобнее всего это сделать в keymap-editor, нажав ••• -\u003e Duplicate layer. Всем клавишам, печатающим буквы, добавить модификатор LShift. Таким образом, попав на этот слой, все напечатанные буквы будут заглавными. В примере рассмотрим активацию режима Caps Word по нажатию комбо клавиш “C” + “V”. Для слоя en создадим комбо со стандартным поведением \u0026caps_word, комбо должно активироваться только на слое en. Для слоя ru создадим комбо с поведением \u0026tog 2 (2 - номер слоя cw_ru), на клавиши “C” + “V”, ограничим чтобы это комбо срабатывало только на слоях ru и cw_ru. Для воссоздания активации Caps Word по нажатию LShift + RShift, как в проводных клавиатурах на QMK, можно воспользоваться поведением mod-morph.\nДалее сделаем так, чтобы после нажатия пробела слой cw_ru выключался, для этого создадим параметризованный макрос \u0026cw_off. Первым действием макрос вернет клавиатуру на слой ru нажатием \u0026to 1, вторым действием нажмет переданный в параметре символ. Назначаем на слое cw_ru на место \u0026kp SPACE созданный макрос \u0026cw_off, указав в параметре пробел, и все, мы воссоздали поведение Caps Word для русского языка.\nАналогичным образом можно воссоздать и фичу RuEn word из реализации RuEn в QMK, просто создаем отдельный слой для этой фичи, выделяем клавишу для переключения на этот слой, и также клавишу, которая этот слой выключит. Также можно реализовать, например, Num Word для ввода нескольких цифр и переключения обратно на буквенный слой, может пригодиться, если часто вводите IP-адреса, ведь можно настроить так, чтобы слой Num Word не выключался при нажатии точек.","как-работает-ruen#Как работает RuEn":"Поделим символы на 2 группы и разберем отдельно каждую.","комбо#Комбо":"Реализовать печать символов с любого языка в комбо нам поможет настройка слоев, на которых это комбо активно.\nСоздадим комбо, печатающее символ “#”, при нажатии на клавиши “N” + “M”.\nЧтобы реализовать ruen поведение в случае с символом “#” нам потребуется создать 2 отдельных комбо: одно будет описывать действия, необходимые для печати символа если сейчас активен русский язык, второе комбо будет описывать действия, в случае если сейчас активен английский язык.\nКомбо для русского языка. Для печати символа “#” на русском языке нам потребуется макрос \u0026en так как “#” нет на русской раскладке, выберем макрос и в параметре передадим кейкод HASH. Чтобы задать слои, на которых комбо активно, надо нажать кнопку с иконкой гаечного ключа, нажмем ее и выберем слои ru и sym_ru. Комбо для английского языка. Символ “#” есть в английской раскладке, в качестве действия для комбо назначим обычны \u0026kp HASH. Также настроим чтобы комбо было активно только на слоях en и sym_en.","макросы#Макросы":"Макросы также отлично сочетаются с подходом ruen, позволяя печатать символьные конструкции, или шаблоны из текста независимо от текущего языка. Рассмотрим на примере макроса, который напечатает две фигурные скобки {}, и нажмёт стрелку влево для перемещения курсора между скобками. Чтобы печатать фигурные скобки независимо от языка, нам потребуется создать два отдельных макроса под каждый язык.\nВызов макроса назначим на комбо клавиш “J” + “L”, такое расположение будет несложно запомнить, ведь фигурные скобки на символьном слое находятся на этих же местах.\nЕсли использование комбо неудобно, Вы можете просто назначить эти макросы на подходящие клавиши на соответствующих языковых слоях.\nСоздаем комбо, настраиваем слои, на которых это комбо активно, и все, фигурные скобки доступны на любом языке на базовом слое!\nТакже удобным может оказаться использование аналогичных комбо для квадратных скобок, круглых скобок (круглые скобки находятся на одинаковых местах в обоих языках и не требуют создания 2 макросов) и двойных кавычек.","основная-идея#Основная идея":"В целом печать какого либо символа работает так: клавиатура отправляет информацию, что была нажата клавиша в определенной позиции, а ОС принимает это нажатие, и в зависимости от того, какая сейчас раскладка в ОС, напечатает нужный символ. Рассмотрим на примерах.\nНа клавиатуре нажата клавиша “KC_Q”\nесли в ОС выбрана стандартная английская раскладка, то напечатается буква “Q”; если в ОС выбрана стандартная русская раскладка, то напечатается буква “Й”. Наличие разных букв в разных раскладках по большей части привычное дело, хотя существуют и фонетические раскладки, при которых, например букву “О” располагают в русском и английском на одном месте, это позволяет снизить когнитивную нагрузку на запоминание разных раскладок, но слова в русском и английском строятся по-разному, и в удобстве печати фонетическая раскладка будет уступать.\nНа клавиатуре нажата клавиша “SLASH”\nесли в ОС выбрана стандартная английская раскладка, то напечатается слэш “/”; если в ОС выбрана стандартная русская раскладка, то напечатается точка “.”. На клавиатуре нажата клавиша “DOT”\nесли в ОС выбрана стандартная английская раскладка, то напечатается точка “.”; если в ОС выбрана стандартная русская раскладка, то напечатается буква “Ю”. На клавиатуре нажата клавиша “LEFT_BRACE”\nесли в ОС выбрана стандартная английская раскладка, то напечатается символ “{”; если в ОС выбрана стандартная русская раскладка, то напечатается буква “Х”. Проблематика обозначена - в стандартных раскладках ОС точка, и многие другие символы, печатаются совсем разными клавишами, а некоторых символов, как например “{” в русской раскладке нет вовсе. Рассмотрим возможные решения задачи унификации расположения символов. Решить можно двумя способами:\nна стороне ОС, установив на компьютер раскладку, в которой символы находятся на одной клавише, например https://github.com/braindefender/universal-layout, но тут стоит учитывать, что устанавливать раскладку надо на каждый компьютер, также как и на удаленные рабочие столы к которым подключаетесь; на стороне клавиатуры, настроив раскладку с использованием подхода RuEn, тут также есть минус в том, что эти настройки находятся именно в клавиатуре и на встроенной клавиатуре ноутбука символы на разных языках будут находиться на разных клавишах. Далее в статье рассказано о способе решения задачи на стороне клавиатуры с использованием подхода RuEn.","отображение-кириллицы-в-keymap-editor#Отображение кириллицы в keymap-editor":"Для удобства модификации раскладки в прошивке ruen добавлены кейкоды алиасы, такие как RU_COMMA или RU_CYRILLIC_TSE, отображающие на раскладке символы русской раскладки, при этом при нажатии RU_COMMA в ОС передастся скан-код SC_SLASH так как в стандартной раскладке ЙЦУКЕН точка находится на клавише слэш.\nЭти кейкоды облегчают визуальное понимание раскладки, при этом RU_COMMA это просто алиас для кейкода SLASH, и если при нажатии RU_COMMA в ОС включена английская раскладка, то напечатается буква слэш.\nС этими кейкодами-алиасами очень удобно настраивать раскладки, отличные от ЙЦУКЕН.","переключение-по-gui--space-без-необходимости-синхронизации#Переключение по GUI + Space без необходимости синхронизации":"Избавиться от необходимости ручной синхронизации языков при использовании переключения по нажатию GUI + Space возможно с помощью гибрида переключения по модели тоггл и переключения отдельными сочетаниями клавиш, как это сделано с комбо в раскладке ruen по умолчанию, все еще потребуется настроить отдельные сочетания в ОС, но для переключения языка можно будет нажимать привычное сочетание клавиш.\nНастраиваем в ОС сочетания клавиш Ctrl + Shift + 1 для включения английского языка, и Ctrl + Shift + 2 для включения русского и создаем два mod-morph поведения:\n\u0026en_space: без модификаторов нажатие \u0026kp Space, с модификатором LGUI вызов макроса \u0026layer_en; \u0026ru_space: без модификаторов нажатие \u0026kp Space, с модификатором LGUI вызов макроса \u0026layer_ru. Далее назначаем на en слое вместо \u0026kp Space поведение \u0026ru_space, на ru слое вместо \u0026kp Space поведение \u0026en_space. Теперь при нажатии GUI + Space язык будет переключаться в ОС и одновременно производиться синхронизация языка в клавиатуре.","переключение-языка-по-модели-тоггл#Переключение языка по модели тоггл":"Полноценной работы RuEn можно добиться и используя стандартные сочетания клавиш для переключения языка в ОС, такие как GUI + Space, Ctrl + Space. Чтобы этого достичь при нажатии сочетания клавиш переключения языка мы также должны и переключать слой в клавиатуре.\nКак это реализовать рассмотрим на примере с сочетанием GUI + Space.\nПервым шагом создадим макрос \u0026lg_tog, состоящий из двух действий - нажатия GUI + Space и \u0026tog 1. \u0026tog 1 включит слой ru, если мы находимся на слое en, и обратно, включит en, если сейчас активен ru. Таким макросом мы одновременно тогглим и язык в ОС, и слой в клавиатуре.\nДалее, чтобы выходить из ситуаций, когда на клавиатуре включен слой ru, а в ОС английский язык, нам нужен способ синхронизации состояния языков. Для этого Вы можете назначить на одну из клавиш поведение \u0026tog 1, и когда произошла рассинхронизация - просто нажмите эту клавишу и состояния снова синхронизируются.\nПодход по модели тоггл не является предпочтительным как раз из-за необходимости отдельно синхронизировать состояния языка ОС с клавиатурой. Имея 2 отдельных сочетания клавиш для языков, синхронизация происходит регулярно, при нажатии \u0026layer_en или \u0026layer_ru.\nСледующим шагом сделаем так, чтобы при нажатии на клавиатуре сочетания GUI + Space, срабатывал созданный ранее макрос \u0026lg_tog, для этого нам пригодится поведение mod-morph из ZMK.\nСоздадим новое кастомное поведение типа Mod Morph Behavior; Назовем его “lg_space”; При нажатии \u0026lg_space без модификатора “LGUI” сработает действие NORMAL и нажмется \u0026kp SPACE; Если при нажатии \u0026lg_space был зажат модификатор “LGUI”, то сработает MODIFIED и вызовется макрос \u0026lg_tog. Также нам необходимо изменить сочетание клавиш смены языка в макросах \u0026to_ru и \u0026to_en, так как эти макросы задействованы в макросе \u0026en, используемом для печати символов.\nПоследним шагом назначаем созданный mod-morph вместо обычного пробела на нужных слоях, и все, состояние языков в ОС и клавиатуре будет синхронно переключаться.\nНа Android устройствах для переключения языка также используется сочетание клавиш GUI + Space, если выберете этот способ переключения, то ruen будет работать также на телефоне и планшете.","с-чего-начать#С чего начать":"Для клавиатур Ergohaven подготовлены раскладки, содержащие в себе нужные для настройки макросы, эти раскладки имеют постфикс _ruen в названии.\nМожно взять ruen раскладку за основу, или если у вас уже есть много наработок в своей раскладке, просто создать в ней такие же макросы и создать отдельные слои для каждого языка.\nПри переносе макросов в свою раскладку обратите внимание также на параметры макросов, отображаемые при нажатии на кнопку с иконкой гаечного ключа, важно не забыть перенести настройки Wait (ms) и Tap (ms).\nМакросы в раскладке ruen ориентированы на использование сочетаний для безусловного переключения языка, Ctrl + Shift + 1 для включения английского языка, и Ctrl + Shift + 2 для включения русского языка (аналог режима RuEn M1M2 из Vial). Такой подход требует дополнительной настройки на стороне ОС, но при этом сильно упрощает синхронизацию языка в клавиатуре с языком в ОС. Если же такой подход переключения языка Вам по какой-то причине не подходит, подход ruen неплохо уживается и со стандартным сочетанием клавиш GUI + Space, подробнее описано в разделе Переключение языка по модели тоггл (аналог режимов RuEn M0 и RuEn Default из Vial).","символы-которые-встречаются-в-обоих-языках#Символы, которые встречаются в обоих языках":"Первая группа - символы, которые встречаются в обоих языках, но расположены на разных клавишах, как например точка или знак вопроса. Для объединения расположения таких символов нам нужно каким-то образом дать клавиатуре понять, какой сейчас язык в ОС, чтобы клавиатура нажала соответствующую языку клавишу. Например, если мы хотим унифицировать положение точки, то на русском языке клавиатуре надо отправить в ОС нажатие клавиши SLASH, а на английском DOT.\nДля решения этой задачи отлично подходит функционал слоев, мы можем настроить так, чтобы одновременно с переключенем языка в ОС, переключался и слой в клавиатуре, и тогда он будет выполнять функцию переменной, в зависимости от этой переменной и отправится код нужной клавиши. В качестве описанной ранее переменной, в раскладке ruen имеются 2 отдельных слоя en и ru. Чтобы расположить точку на одну и ту же клавишу делаем следующие действия:\nНа слое en назначаем на нужную клавишу поведение \u0026kp DOT На слое ru на эту же позицию назначаем поведение \u0026kp SLASH Для переключения языка надо использовать только макросы \u0026layer_en и \u0026layer_ru. Макрос \u0026layer_ru отправит в ОС сочетание клавиш Ctrl + Shift + 2, таким образом ОС переключится на русский язык и одновременно с этим клавиатура переключится на слой ru, таким образом ОС и клавиатура будут синхронно находиться на русской раскладке, аналогично макрос \u0026layer_en отправит в ОС сочетание Ctrl + Shift + 1 для включения английской раскладки, и переключит клавиатуру на слой en. В раскладке ruen по умолчанию эти макросы назначены на комбо клавиш “E” + “R”. Находясь на ru слое нажатие комбо “E” + “R” переключит язык в ОС на английский и сменит слой на en, а находясь на en слое при нажатии комбо произойдет обратное, язык в ОС переключится на русский, слой сменится на ru.\nМакросы \u0026layer_en и \u0026layer_ru можно назначить на любое место в раскладке, например на две разные клавиши или два разных комбо “E” + “R” и “U” + “I”.\nЦель достигнута, теперь точка печатается на обоих языках нажатием одной и той же клавиши.","символы-которые-встречаются-только-в-одном-из-языков#Символы, которые встречаются только в одном из языков":"Вторая группа - символы, которые есть в раскладке только одного из языков, например символ “\u0026” есть только на английской раскладке. Чтобы напечатать символ из этой группы, находясь на русской раскладке, надо сделать следующие действия:\nПереключить язык в ОС на английский нажатием Ctrl + Shift + 1;\nНажать сочетание клавиш для печати символа, в случае с символом \u0026, это сочетание клавиш Shift + 7;\nПереключить язык в ОС обратно на русский нажатием Ctrl + Shift + 2.\nВсе эти действия содержит в себе параметризованный макрос \u0026en из ruen раскладки. Просто назначаем макрос на клавишу на слое ru, и в качестве параметра указываем кейкод AMPS, либо сочетание клавиш Shift + 7.\nВ некоторых ситуациях может оказаться полезным удержать клавишу с символом нажатой, и макрос \u0026en из ruen раскладки корректно обработает это нажатие, зажав символ в английской раскладке.\nНо что делать, если сейчас включен английский язык, ведь если мы используем этот макрос на нем, то напечатается символ “\u0026” и последним шагом язык переключится на русский? С решением этой проблемы нас снова выручает функционал слоев в клавиатуре. Находясь на английском языке для того чтобы напечатать этот символ нет необходимости в переключении на другой язык, и мы просто можем назначить стандартное поведение \u0026kp AMPS на нужную клавишу.\nСимволов, которые есть только на русской раскладке, не очень много, и макроса под них в раскладке ruen нет, но если вдруг Вы хотели бы печатать символ “№” на любой раскладке, то можете создать макрос \u0026ru скопировав макрос \u0026en и поменяв местами сочетания клавиш для переключения языка в ОС.","символьный-слой#Символьный слой":"На базовых слоях ru и en кнопок под все нужные символы конечно же не хватит, да и в целом символы может быть удобнее расположить на отдельном символьном слое, чтобы применить подход ruen для создания отдельного символьного слоя потребуется создать 2 отдельных слоя, один для печати символов, находясь на русском языке, и второй, для печати символов, находясь на английском языке. В раскладке ruen по умолчанию это слои sym_en и sym_ru.\nЧтобы соблюсти синхронизацию языков в ОС и клавиатуре переход на sym_ru должен происходить с слоя ru, а на sym_en с слоя en, таким образом клавиатура будет понимать, какой сейчас активен язык, и для печати символа будет отправлять соответствующие текущему языку действия.\nДля переключения на языковые символьные слои также отлично подойдет поведение \u0026sl, активирующее символьный слой на одно нажатие, и после возвращает пользователя на предыдущий активный слой, при необходимости такую клавишу можно зажать и она будет работать как обычный \u0026mo."},"title":"RuEn раскладка для беспроводных клавиатур"}}